{
 "cells": [
  {
   "cell_type": "markdown",
   "id": "68123940-576e-4465-8dbf-1ed049b1fefb",
   "metadata": {},
   "source": [
    "# Knowledge Extraction Using NER Relationships"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "295e2f37-a1e6-492b-afae-e00b0a3f4510",
   "metadata": {},
   "outputs": [],
   "source": [
    "#!pip install transformers"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "2f98b980-36a2-42b4-8fa7-2da93fb8127d",
   "metadata": {},
   "outputs": [],
   "source": [
    "#!git clone https://github.com/thunlp/OpenNRE.git"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "e54b5bf7-dc00-472a-a0d7-90809a614cd4",
   "metadata": {},
   "outputs": [],
   "source": [
    "#!pip install -r OpenNRE/requirements.txt"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "c0e33be9-0dc7-4d59-8cb4-f838d1545129",
   "metadata": {},
   "outputs": [],
   "source": [
    "#!python OpenNRE/setup.py install"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "5ed04138-8774-4550-9bd3-0bc0a8f3e28c",
   "metadata": {},
   "outputs": [],
   "source": [
    "#!pip install neo4j"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "fd204169-fa7c-41bb-b46b-316b1905ae92",
   "metadata": {},
   "outputs": [],
   "source": [
    "from neo4j import GraphDatabase\n",
    "from neo4j.exceptions import ServiceUnavailable\n",
    "import json\n",
    "\n",
    "# Initialize the graph DB and delete all the nodes and relationships\n",
    "graph = GraphDatabase.driver(\n",
    "    \"neo4j+s://c22b0b3c.databases.neo4j.io:7687\",\n",
    "    auth=(\"neo4j\", \"akterzObCsJTwulDEG7AFlCkDcMyGC7RblEnmXbg7aE\")\n",
    ")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "id": "053d20c9-f5e8-47ea-b1ac-4131263b9b49",
   "metadata": {},
   "outputs": [],
   "source": [
    "query = (\n",
    "        \"MATCH (all_nodes)\"\n",
    "        \"OPTIONAL MATCH (all_nodes)-[all_rels]->()\"\n",
    "        \"DELETE all_nodes, all_rels\"\n",
    "    )\n",
    "with graph.session() as session:\n",
    "    result = session.run(query)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "id": "fdb91df1-4fa0-452e-bd40-e15bbfe9f908",
   "metadata": {},
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "2024-04-27 21:09:14.576491: I tensorflow/core/platform/cpu_feature_guard.cc:210] This TensorFlow binary is optimized to use available CPU instructions in performance-critical operations.\n",
      "To enable the following instructions: AVX2 FMA, in other operations, rebuild TensorFlow with the appropriate compiler flags.\n",
      "2024-04-27 21:09:48,387 - root - INFO - Loading BERT pre-trained checkpoint.\n",
      "Some weights of the model checkpoint at /Users/sususan/.opennre/pretrain/bert-base-uncased were not used when initializing BertModel: ['cls.predictions.transform.dense.weight', 'cls.predictions.transform.LayerNorm.weight', 'cls.predictions.transform.dense.bias', 'cls.seq_relationship.bias', 'cls.predictions.bias', 'cls.predictions.decoder.weight', 'cls.predictions.transform.LayerNorm.bias', 'cls.seq_relationship.weight']\n",
      "- This IS expected if you are initializing BertModel from the checkpoint of a model trained on another task or with another architecture (e.g. initializing a BertForSequenceClassification model from a BertForPreTraining model).\n",
      "- This IS NOT expected if you are initializing BertModel from the checkpoint of a model that you expect to be exactly identical (initializing a BertForSequenceClassification model from a BertForSequenceClassification model).\n"
     ]
    }
   ],
   "source": [
    "import transformers\n",
    "import OpenNRE.opennre as opennre\n",
    "\n",
    "model = opennre.get_model('wiki80_bert_softmax')"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "id": "71250798-0322-488c-ae0e-fdc9f60330fa",
   "metadata": {
    "scrolled": true
   },
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>Id</th>\n",
       "      <th>Section</th>\n",
       "      <th>SubSection</th>\n",
       "      <th>Label</th>\n",
       "      <th>Question</th>\n",
       "      <th>Answer</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>1</td>\n",
       "      <td>Bank Cards</td>\n",
       "      <td>Applying for a DBS Debit Card or Credit Card</td>\n",
       "      <td>eligible_debit_card</td>\n",
       "      <td>Am I eligible for a debit card?</td>\n",
       "      <td>You must be at least 16 years old and have a P...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>2</td>\n",
       "      <td>Bank Cards</td>\n",
       "      <td>Applying for a DBS Debit Card or Credit Card</td>\n",
       "      <td>eligible_credit_card</td>\n",
       "      <td>Am I eligible for a credit card?</td>\n",
       "      <td>If you're Singaporean or have permanent reside...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>3</td>\n",
       "      <td>Bank Cards</td>\n",
       "      <td>Applying for a DBS Debit Card or Credit Card</td>\n",
       "      <td>apply_card</td>\n",
       "      <td>What do I need to apply?</td>\n",
       "      <td>The type of document you’ll need varies. Click...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>4</td>\n",
       "      <td>Bank Cards</td>\n",
       "      <td>Applying for a DBS Debit Card or Credit Card</td>\n",
       "      <td>apply_card_duration</td>\n",
       "      <td>How long does it take?</td>\n",
       "      <td>Please allow 7 working days for processing. Ap...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>5</td>\n",
       "      <td>Bank Cards</td>\n",
       "      <td>Applying for a DBS Debit Card or Credit Card</td>\n",
       "      <td>apply_card_turned dow</td>\n",
       "      <td>Why was my application turned down?</td>\n",
       "      <td>All applications go through an approval proces...</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "   Id     Section                                    SubSection  \\\n",
       "0   1  Bank Cards  Applying for a DBS Debit Card or Credit Card   \n",
       "1   2  Bank Cards  Applying for a DBS Debit Card or Credit Card   \n",
       "2   3  Bank Cards  Applying for a DBS Debit Card or Credit Card   \n",
       "3   4  Bank Cards  Applying for a DBS Debit Card or Credit Card   \n",
       "4   5  Bank Cards  Applying for a DBS Debit Card or Credit Card   \n",
       "\n",
       "                   Label                             Question  \\\n",
       "0    eligible_debit_card      Am I eligible for a debit card?   \n",
       "1   eligible_credit_card     Am I eligible for a credit card?   \n",
       "2             apply_card             What do I need to apply?   \n",
       "3    apply_card_duration               How long does it take?   \n",
       "4  apply_card_turned dow  Why was my application turned down?   \n",
       "\n",
       "                                              Answer  \n",
       "0  You must be at least 16 years old and have a P...  \n",
       "1  If you're Singaporean or have permanent reside...  \n",
       "2  The type of document you’ll need varies. Click...  \n",
       "3  Please allow 7 working days for processing. Ap...  \n",
       "4  All applications go through an approval proces...  "
      ]
     },
     "execution_count": 6,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "import pandas as pd\n",
    "FAQ = pd.read_csv(\"./corpus/DBS FAQ.csv\")\n",
    "FAQ.head()"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "2fd9ce56-98ec-4c67-b13d-951e729c5bda",
   "metadata": {},
   "source": [
    "# Create Constraint"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 9,
   "id": "40818c90-cb48-4bd9-a52e-6cfa0a9d321d",
   "metadata": {},
   "outputs": [],
   "source": [
    "with graph.session() as session:\n",
    "    result = session.run('CREATE CONSTRAINT IF NOT EXISTS FOR (q:Question) REQUIRE q.Question IS UNIQUE;')\n",
    "\n",
    "with graph.session() as session:\n",
    "    result = session.run('CREATE CONSTRAINT IF NOT EXISTS FOR (a:Answer) REQUIRE a.Answer IS UNIQUE;')\n",
    "\n",
    "with graph.session() as session:\n",
    "    result = session.run('CREATE CONSTRAINT IF NOT EXISTS FOR (f:FAQ) REQUIRE f.Id IS UNIQUE;')\n",
    "\n",
    "with graph.session() as session:\n",
    "    result = session.run('CREATE CONSTRAINT IF NOT EXISTS FOR (s:Section) REQUIRE s.Section IS UNIQUE;')\n",
    "\n",
    "with graph.session() as session:\n",
    "    result = session.run('CREATE CONSTRAINT IF NOT EXISTS FOR (ss:SubSection) REQUIRE ss.SubSection IS UNIQUE;')\n",
    "\n",
    "with graph.session() as session:\n",
    "    result = session.run('CREATE TEXT INDEX question IF NOT EXISTS FOR (f:FAQ) ON f.Question;')"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "40c618ab-4cf2-4e54-9827-8dcc0ae4b7b7",
   "metadata": {},
   "source": [
    "# Create Relationship"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "id": "77cd7403-26a6-4074-9ee2-1e43cd277af5",
   "metadata": {},
   "outputs": [],
   "source": [
    "FAQ_import_query = \"\"\"\n",
    "UNWIND $data AS row\n",
    "MERGE (f:FAQ {Id: row.Id})\n",
    "MERGE (q:Question {Label: row.Question}) - [:PART_OF]->(f)\n",
    "MERGE (a:Answer {Label: row.Answer}) - [:PART_OF]->(f)\n",
    "SET f += apoc.map.clean(row, [\"Id\", \"Section\", \"SubSection\"], [])\n",
    "WITH f,a,q,row.Section AS Section, row.SubSection AS SubSection, row.Question AS Question, row.Answer AS Answer\n",
    "MERGE (s:Section {Label: Section})\n",
    "MERGE (ss:SubSection {Label: SubSection})\n",
    "MERGE (ss)-[:SUBSECTION_OF]->(s)\n",
    "MERGE (f)-[:HAS_SUBSECTION]->(ss)\n",
    "MERGE (q)-[:QUESTION_OF]->(a)\n",
    "MERGE (a)-[:ANSWER_OF]->(q)\n",
    "\"\"\"\n",
    "with graph.session() as session:\n",
    "    result = session.run(FAQ_import_query, {\"data\": FAQ.to_dict(\"records\")})"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "8dfa5c87-6232-43f5-813d-c238ef0a004b",
   "metadata": {},
   "source": [
    "# Knowledge Extraction"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 11,
   "id": "a98eb73b-1415-4059-8013-44765f3a6d65",
   "metadata": {},
   "outputs": [],
   "source": [
    "import networkx as nx\n",
    "import matplotlib.pyplot as plt\n",
    "import en_core_web_sm\n",
    "import en_core_web_lg\n",
    "\n",
    "#nlp = en_core_web_sm.load()\n",
    "nlp = en_core_web_lg.load()\n",
    "\n",
    "def knowledgeExtraction(questions,answers, FAQIDs):\n",
    "   \n",
    "    exist_ent = {}\n",
    "    exist_relationship = []\n",
    "    \n",
    "    for i in range(0, len(answers)):\n",
    "        question = questions[i]\n",
    "        answer = answers[i]\n",
    "        doc = nlp(answer)\n",
    "        names_of_entities = []\n",
    "        entities = []\n",
    "        \n",
    "        for ent in doc.ents:\n",
    "            if ent.text not in names_of_entities:\n",
    "                names_of_entities.append(ent.text)\n",
    "                entities.append(ent)\n",
    "    \n",
    "        for ent in entities:\n",
    "            if exist_ent.get(ent.text) is None:\n",
    "                exist_ent[ent.text] = ent.text\n",
    "                query = (\n",
    "                \"MATCH (FAQ:FAQ {Id: $FAQ_Id})\"\n",
    "                #\"CREATE (node:Entity {name: $name, type: $type})- [:MENTIONS] -> (FAQ)\"\n",
    "                \"MERGE (node: Entity {name: $name, type: $type}) - [:MENTIONS] -> (FAQ)\" # Create Node Entity\n",
    "                \"RETURN node\"\n",
    "                )\n",
    "                with graph.session() as session:\n",
    "                    result = session.run(query, name=ent.text, type = ent.label_,FAQ_Id = FAQIDs[i])\n",
    "                print(\"create new node with name as {0} and with type as {1} and sentiment with {2}\".format(ent.text, ent.label_, ent.sentiment))\n",
    "    \n",
    "        for i in range(len(entities)):\n",
    "            for j in range(i + 1, len(entities)):\n",
    "                text_i = entities[i].text\n",
    "                text_j = entities[j].text\n",
    "                loc_h = answer.find(text_i)\n",
    "                loc_t = answer.find(text_j)\n",
    "                result = model.infer({'text': answer, 'h': {'pos': (loc_h, loc_h + len(text_i))},\n",
    "                                    't': {'pos': (loc_t, loc_t + len(text_j))}})\n",
    "                (rel, confidence) = result[0].replace(' ', '_'), result[1]\n",
    "    \n",
    "                record = (text_i, text_j, rel, confidence)\n",
    "    \n",
    "                result_rev = model.infer({'text': answer, 'h': {'pos': (loc_t, loc_t + len(text_j))},\n",
    "                                    't': {'pos': (loc_h, loc_h + len(text_i))}})\n",
    "                (rel_rev, confidence) = result_rev[0].replace(' ', '_'), result_rev[1]\n",
    "    \n",
    "                record_rev = (text_j, text_i, rel_rev, confidence)\n",
    "                if record not in exist_relationship:\n",
    "                    exist_relationship.append(record)\n",
    "                    if record[3] > 0.8:\n",
    "                        query = (\n",
    "                            \"MATCH (n1 {name: $name1})\"\n",
    "                            \"MATCH (n2 {name: $name2})\"\n",
    "                            \"MERGE (n1) - [r:\"+record[2]+\"] -> (n2)\"\n",
    "                            \"RETURN n1, n2, r\"\n",
    "                        )\n",
    "                        #print(query, name1=exist_ent[text_i], name2=exist_ent[text_j])\n",
    "                        with graph.session() as session:\n",
    "                            result = session.run(query, name1=exist_ent[text_i], name2=exist_ent[text_j])\n",
    "                        print(\"create new relationship {0} - {1} -> {2} with confidence of {3}\".format(record[0], record[2], record[1], record[3]))\n",
    "    \n",
    "                if record_rev not in exist_relationship:\n",
    "                    exist_relationship.append(record_rev)\n",
    "                    if record_rev[3] > 0.8:\n",
    "                        query = (\n",
    "                            \"MATCH (n1 {name: $name1})\"\n",
    "                            \"MATCH (n2 {name: $name2})\"\n",
    "                            \"MERGE (n1) - [r:\"+record_rev[2]+\"] -> (n2)\"   \n",
    "                            \"RETURN n1, n2, r\"\n",
    "                        )\n",
    "                        print(exist_ent[text_j].replace(' ' , '_') + ' ' + exist_ent[text_i] + ' ' + record_rev[2])\n",
    "                        with graph.session() as session:\n",
    "                            result = session.run(query, name1=exist_ent[text_j], name2=exist_ent[text_i])\n",
    "                        print(\"create new relationship {0} - {1} -> {2} with confidence of {3}\".format(record_rev[0], record_rev[2], record_rev[1], record_rev[3]))\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 12,
   "id": "74673072-b6e9-4929-b5c2-c156d7892646",
   "metadata": {},
   "outputs": [],
   "source": [
    "questions = []\n",
    "answers = []\n",
    "FAQIDs = []\n",
    "for i in range(len(FAQ)):\n",
    "    questions.append(FAQ.loc[i].Question)\n",
    "    answers.append(FAQ.loc[i].Answer)\n",
    "    FAQIDs.append(FAQ.loc[i].Id)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 13,
   "id": "d56ffa0e-6e68-4c0f-8cde-8571828f9a34",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "create new node with name as at least 16 years old and with type as DATE and sentiment with 0.0\n",
      "create new node with name as DBS Savings Plus Account and with type as ORG and sentiment with 0.0\n",
      "create new node with name as DBS Autosave Account and with type as ORG and sentiment with 0.0\n",
      "create new node with name as DBS Current Account and with type as ORG and sentiment with 0.0\n",
      "create new node with name as href=\"https://www.dbs.com.sg and with type as ORG and sentiment with 0.0\n",
      "create new node with name as at least 6 months and with type as DATE and sentiment with 0.0\n",
      "create new relationship DBS Savings Plus Account - followed_by -> DBS Autosave Account with confidence of 0.9901670217514038\n",
      "DBS_Autosave_Account DBS Savings Plus Account followed_by\n",
      "create new relationship DBS Autosave Account - followed_by -> DBS Savings Plus Account with confidence of 0.9828715324401855\n",
      "create new relationship DBS Savings Plus Account - followed_by -> DBS Current Account with confidence of 0.9697880148887634\n",
      "DBS_Current_Account DBS Savings Plus Account followed_by\n",
      "create new relationship DBS Current Account - followed_by -> DBS Savings Plus Account with confidence of 0.9342776536941528\n",
      "create new relationship DBS Autosave Account - followed_by -> DBS Current Account with confidence of 0.9852199554443359\n",
      "DBS_Current_Account DBS Autosave Account followed_by\n",
      "create new relationship DBS Current Account - followed_by -> DBS Autosave Account with confidence of 0.9752067923545837\n",
      "create new relationship DBS Autosave Account - followed_by -> href=\"https://www.dbs.com.sg with confidence of 0.8887360692024231\n",
      "href=\"https://www.dbs.com.sg DBS Autosave Account followed_by\n",
      "create new relationship href=\"https://www.dbs.com.sg - followed_by -> DBS Autosave Account with confidence of 0.893096387386322\n",
      "create new relationship DBS Autosave Account - followed_by -> at least 6 months with confidence of 0.9528752565383911\n",
      "at_least_6_months DBS Autosave Account followed_by\n",
      "create new relationship at least 6 months - followed_by -> DBS Autosave Account with confidence of 0.9555076360702515\n",
      "create new node with name as Singaporean and with type as NORP and sentiment with 0.0\n",
      "create new node with name as 21 years of age and with type as DATE and sentiment with 0.0\n",
      "create new node with name as S$30,000 and with type as LOC and sentiment with 0.0\n",
      "create new node with name as Platinum and with type as ORG and sentiment with 0.0\n",
      "create new node with name as a least S$45,000 and with type as MONEY and sentiment with 0.0\n",
      "create new node with name as a year and with type as DATE and sentiment with 0.0\n",
      "create new relationship Singaporean - part_of -> 21 years of age with confidence of 0.8797944784164429\n",
      "21_years_of_age Singaporean part_of\n",
      "create new relationship 21 years of age - part_of -> Singaporean with confidence of 0.9257203936576843\n",
      "create new relationship Singaporean - part_of -> href=\"https://www.dbs.com.sg with confidence of 0.8138021230697632\n",
      "href=\"https://www.dbs.com.sg Singaporean part_of\n",
      "create new relationship href=\"https://www.dbs.com.sg - part_of -> Singaporean with confidence of 0.8959383368492126\n",
      "create new relationship Singaporean - part_of -> S$30,000 with confidence of 0.8951045274734497\n",
      "S$30,000 Singaporean part_of\n",
      "create new relationship S$30,000 - part_of -> Singaporean with confidence of 0.8982707262039185\n",
      "create new relationship Singaporean - part_of -> Platinum with confidence of 0.8691118955612183\n",
      "Platinum Singaporean part_of\n",
      "create new relationship Platinum - part_of -> Singaporean with confidence of 0.9103177189826965\n",
      "create new relationship Singaporean - part_of -> a least S$45,000 with confidence of 0.8691118955612183\n",
      "a_least_S$45,000 Singaporean part_of\n",
      "create new relationship a least S$45,000 - part_of -> Singaporean with confidence of 0.9103177189826965\n",
      "create new relationship Singaporean - part_of -> a year with confidence of 0.8691118955612183\n",
      "a_year Singaporean part_of\n",
      "create new relationship a year - part_of -> Singaporean with confidence of 0.9103177189826965\n",
      "create new relationship href=\"https://www.dbs.com.sg - main_subject -> Platinum with confidence of 0.8060263991355896\n",
      "create new relationship href=\"https://www.dbs.com.sg - main_subject -> a least S$45,000 with confidence of 0.8060263991355896\n",
      "create new relationship href=\"https://www.dbs.com.sg - main_subject -> a year with confidence of 0.8060263991355896\n",
      "create new node with name as 7 working days and with type as DATE and sentiment with 0.0\n",
      "create new node with name as account</a and with type as PERSON and sentiment with 0.0\n",
      "create new node with name as >Debit and with type as WORK_OF_ART and sentiment with 0.0\n",
      "create new node with name as Credit Card and with type as ORG and sentiment with 0.0\n",
      "create new node with name as https://abs.org.sg and with type as ORG and sentiment with 0.0\n",
      "create new relationship 7 working days - has_part -> href=\"https://www.dbs.com.sg with confidence of 0.9762555956840515\n",
      "href=\"https://www.dbs.com.sg 7 working days has_part\n",
      "create new relationship href=\"https://www.dbs.com.sg - has_part -> 7 working days with confidence of 0.9807028770446777\n",
      "create new relationship 7 working days - has_part -> >Debit with confidence of 0.9772714376449585\n",
      ">Debit 7 working days has_part\n",
      "create new relationship >Debit - has_part -> 7 working days with confidence of 0.9797724485397339\n",
      "create new relationship 7 working days - has_part -> Credit Card with confidence of 0.9772714376449585\n",
      "Credit_Card 7 working days has_part\n",
      "create new relationship Credit Card - has_part -> 7 working days with confidence of 0.9797724485397339\n",
      "create new relationship 7 working days - has_part -> https://abs.org.sg with confidence of 0.9772714376449585\n",
      "https://abs.org.sg 7 working days has_part\n",
      "create new relationship https://abs.org.sg - has_part -> 7 working days with confidence of 0.9797724485397339\n",
      "create new node with name as DBS Rewards and with type as ORG and sentiment with 0.0\n",
      "create new node with name as DBS Credit Card and with type as ORG and sentiment with 0.0\n",
      "create new node with name as DBS Points and with type as ORG and sentiment with 0.0\n",
      "create new relationship DBS Rewards - has_part -> DBS Points with confidence of 0.8254706859588623\n",
      "DBS_Points DBS Rewards has_part\n",
      "create new relationship DBS Points - has_part -> DBS Rewards with confidence of 0.8256783485412598\n",
      "create new node with name as DBS Points Redemption Programme and with type as ORG and sentiment with 0.0\n",
      "create new node with name as Programme and with type as ORG and sentiment with 0.0\n",
      "create new node with name as MasterCard Corporate/ Executive and with type as ORG and sentiment with 0.0\n",
      "create new node with name as Visa Corporate/ Business and with type as ORG and sentiment with 0.0\n",
      "create new node with name as DBS Purchasing Card\n",
      "Country Club Corporate Card and with type as PRODUCT and sentiment with 0.0\n",
      "create new node with name as DBS Esso Card and with type as ORG and sentiment with 0.0\n",
      "create new node with name as DBS Credit/Debit Card\n",
      "POSB Credit Card and with type as ORG and sentiment with 0.0\n",
      "create new relationship DBS Points Redemption Programme - instance_of -> Programme with confidence of 0.9372410178184509\n",
      "create new relationship DBS Points Redemption Programme - main_subject -> MasterCard Corporate/ Executive with confidence of 0.9070440530776978\n",
      "MasterCard_Corporate/_Executive DBS Points Redemption Programme main_subject\n",
      "create new relationship MasterCard Corporate/ Executive - main_subject -> DBS Points Redemption Programme with confidence of 0.9378654360771179\n",
      "DBS_Purchasing_Card\n",
      "Country_Club_Corporate_Card DBS Points Redemption Programme main_subject\n",
      "create new relationship DBS Purchasing Card\n",
      "Country Club Corporate Card - main_subject -> DBS Points Redemption Programme with confidence of 0.9254200458526611\n",
      "create new relationship DBS Points Redemption Programme - main_subject -> DBS Esso Card with confidence of 0.9855319857597351\n",
      "DBS_Esso_Card DBS Points Redemption Programme main_subject\n",
      "create new relationship DBS Esso Card - main_subject -> DBS Points Redemption Programme with confidence of 0.9882778525352478\n",
      "create new relationship DBS Points Redemption Programme - main_subject -> DBS Credit/Debit Card\n",
      "POSB Credit Card with confidence of 0.988377034664154\n",
      "DBS_Credit/Debit_Card\n",
      "POSB_Credit_Card DBS Points Redemption Programme main_subject\n",
      "create new relationship DBS Credit/Debit Card\n",
      "POSB Credit Card - main_subject -> DBS Points Redemption Programme with confidence of 0.9906170964241028\n",
      "create new relationship Programme - main_subject -> MasterCard Corporate/ Executive with confidence of 0.8769432902336121\n",
      "create new relationship Programme - main_subject -> DBS Purchasing Card\n",
      "Country Club Corporate Card with confidence of 0.819908618927002\n",
      "create new relationship Programme - main_subject -> DBS Esso Card with confidence of 0.9066499471664429\n",
      "create new relationship Programme - main_subject -> DBS Credit/Debit Card\n",
      "POSB Credit Card with confidence of 0.9369453191757202\n",
      "create new relationship MasterCard Corporate/ Executive - followed_by -> Visa Corporate/ Business with confidence of 0.893593966960907\n",
      "create new relationship MasterCard Corporate/ Executive - has_part -> DBS Purchasing Card\n",
      "Country Club Corporate Card with confidence of 0.8935515880584717\n",
      "DBS_Purchasing_Card\n",
      "Country_Club_Corporate_Card MasterCard Corporate/ Executive has_part\n",
      "create new relationship DBS Purchasing Card\n",
      "Country Club Corporate Card - has_part -> MasterCard Corporate/ Executive with confidence of 0.9379759430885315\n",
      "DBS_Esso_Card MasterCard Corporate/ Executive has_part\n",
      "create new relationship DBS Esso Card - has_part -> MasterCard Corporate/ Executive with confidence of 0.8021602034568787\n",
      "create new relationship MasterCard Corporate/ Executive - has_part -> DBS Credit/Debit Card\n",
      "POSB Credit Card with confidence of 0.9722890853881836\n",
      "DBS_Credit/Debit_Card\n",
      "POSB_Credit_Card MasterCard Corporate/ Executive has_part\n",
      "create new relationship DBS Credit/Debit Card\n",
      "POSB Credit Card - has_part -> MasterCard Corporate/ Executive with confidence of 0.9815897345542908\n",
      "create new node with name as 1 and with type as CARDINAL and sentiment with 0.0\n",
      "create new node with name as DBS Point and with type as LOC and sentiment with 0.0\n",
      "DBS_Point 1 has_part\n",
      "create new relationship DBS Point - has_part -> 1 with confidence of 0.8132795691490173\n",
      "create new node with name as 3 and with type as CARDINAL and sentiment with 0.0\n",
      "create new node with name as 5 and with type as CARDINAL and sentiment with 0.0\n",
      "create new node with name as Singapore and with type as GPE and sentiment with 0.0\n",
      "create new relationship 3 - followed_by -> DBS Points with confidence of 0.860730767250061\n",
      "DBS_Points 3 followed_by\n",
      "create new relationship DBS Points - followed_by -> 3 with confidence of 0.8954610824584961\n",
      "Singapore 3 has_part\n",
      "create new relationship Singapore - has_part -> 3 with confidence of 0.8134176135063171\n",
      "create new node with name as Bill and with type as PERSON and sentiment with 0.0\n",
      "create new node with name as AXS and with type as ORG and sentiment with 0.0\n",
      "create new node with name as SAM and with type as ORG and sentiment with 0.0\n",
      "create new node with name as EZ-Link and with type as ORG and sentiment with 0.0\n",
      "create new node with name as GrabPay and with type as ORG and sentiment with 0.0\n",
      "create new node with name as FlashPay and with type as ORG and sentiment with 0.0\n",
      "create new node with name as Razer Pay and with type as ORG and sentiment with 0.0\n",
      "create new node with name as ShopeePay and with type as ORG and sentiment with 0.0\n",
      "create new node with name as Singtel Dash and with type as ORG and sentiment with 0.0\n",
      "create new node with name as Transit Link and with type as ORG and sentiment with 0.0\n",
      "create new node with name as annual and with type as DATE and sentiment with 0.0\n",
      "create new node with name as DBS and with type as ORG and sentiment with 0.0\n",
      "create new relationship DBS Points - part_of -> Bill with confidence of 0.960317850112915\n",
      "AXS DBS Points followed_by\n",
      "create new relationship AXS - followed_by -> DBS Points with confidence of 0.8749830722808838\n",
      "create new relationship DBS Points - followed_by -> SAM with confidence of 0.9634966254234314\n",
      "SAM DBS Points followed_by\n",
      "create new relationship SAM - followed_by -> DBS Points with confidence of 0.9681462645530701\n",
      "create new relationship DBS Points - followed_by -> EZ-Link with confidence of 0.932285726070404\n",
      "EZ-Link DBS Points followed_by\n",
      "create new relationship EZ-Link - followed_by -> DBS Points with confidence of 0.9263111352920532\n",
      "create new relationship DBS Points - followed_by -> GrabPay with confidence of 0.932285726070404\n",
      "GrabPay DBS Points followed_by\n",
      "create new relationship GrabPay - followed_by -> DBS Points with confidence of 0.9263111352920532\n",
      "create new relationship DBS Points - followed_by -> FlashPay with confidence of 0.932285726070404\n",
      "FlashPay DBS Points followed_by\n",
      "create new relationship FlashPay - followed_by -> DBS Points with confidence of 0.9263111352920532\n",
      "create new relationship DBS Points - followed_by -> Razer Pay with confidence of 0.932285726070404\n",
      "Razer_Pay DBS Points followed_by\n",
      "create new relationship Razer Pay - followed_by -> DBS Points with confidence of 0.9263111352920532\n",
      "create new relationship DBS Points - followed_by -> ShopeePay with confidence of 0.932285726070404\n",
      "ShopeePay DBS Points followed_by\n",
      "create new relationship ShopeePay - followed_by -> DBS Points with confidence of 0.9263111352920532\n",
      "create new relationship DBS Points - followed_by -> Singtel Dash with confidence of 0.932285726070404\n",
      "Singtel_Dash DBS Points followed_by\n",
      "create new relationship Singtel Dash - followed_by -> DBS Points with confidence of 0.9263111352920532\n",
      "create new relationship DBS Points - followed_by -> Transit Link with confidence of 0.932285726070404\n",
      "Transit_Link DBS Points followed_by\n",
      "create new relationship Transit Link - followed_by -> DBS Points with confidence of 0.9263111352920532\n",
      "create new relationship DBS Points - followed_by -> annual with confidence of 0.932285726070404\n",
      "annual DBS Points followed_by\n",
      "create new relationship annual - followed_by -> DBS Points with confidence of 0.9263111352920532\n",
      "create new relationship Bill - main_subject -> EZ-Link with confidence of 0.8909081220626831\n",
      "EZ-Link Bill main_subject\n",
      "create new relationship EZ-Link - main_subject -> Bill with confidence of 0.9790481328964233\n",
      "create new relationship Bill - main_subject -> GrabPay with confidence of 0.8909081220626831\n",
      "GrabPay Bill main_subject\n",
      "create new relationship GrabPay - main_subject -> Bill with confidence of 0.9790481328964233\n",
      "create new relationship Bill - main_subject -> FlashPay with confidence of 0.8909081220626831\n",
      "FlashPay Bill main_subject\n",
      "create new relationship FlashPay - main_subject -> Bill with confidence of 0.9790481328964233\n",
      "create new relationship Bill - main_subject -> Razer Pay with confidence of 0.8909081220626831\n",
      "Razer_Pay Bill main_subject\n",
      "create new relationship Razer Pay - main_subject -> Bill with confidence of 0.9790481328964233\n",
      "create new relationship Bill - main_subject -> ShopeePay with confidence of 0.8909081220626831\n",
      "ShopeePay Bill main_subject\n",
      "create new relationship ShopeePay - main_subject -> Bill with confidence of 0.9790481328964233\n",
      "create new relationship Bill - main_subject -> Singtel Dash with confidence of 0.8909081220626831\n",
      "Singtel_Dash Bill main_subject\n",
      "create new relationship Singtel Dash - main_subject -> Bill with confidence of 0.9790481328964233\n",
      "create new relationship Bill - main_subject -> Transit Link with confidence of 0.8909081220626831\n",
      "Transit_Link Bill main_subject\n",
      "create new relationship Transit Link - main_subject -> Bill with confidence of 0.9790481328964233\n",
      "create new relationship Bill - main_subject -> annual with confidence of 0.8909081220626831\n",
      "annual Bill main_subject\n",
      "create new relationship annual - main_subject -> Bill with confidence of 0.9790481328964233\n",
      "create new relationship AXS - followed_by -> SAM with confidence of 0.9554804563522339\n",
      "SAM AXS followed_by\n",
      "create new relationship SAM - followed_by -> AXS with confidence of 0.8533704876899719\n",
      "create new relationship SAM - followed_by -> DBS with confidence of 0.930884063243866\n",
      "DBS SAM followed_by\n",
      "create new relationship DBS - followed_by -> SAM with confidence of 0.9429145455360413\n",
      "create new relationship EZ-Link - followed_by -> DBS with confidence of 0.9219642877578735\n",
      "DBS EZ-Link followed_by\n",
      "create new relationship DBS - followed_by -> EZ-Link with confidence of 0.9385015964508057\n",
      "create new relationship GrabPay - followed_by -> DBS with confidence of 0.9219642877578735\n",
      "DBS GrabPay followed_by\n",
      "create new relationship DBS - followed_by -> GrabPay with confidence of 0.9385015964508057\n",
      "create new relationship FlashPay - followed_by -> DBS with confidence of 0.9219642877578735\n",
      "DBS FlashPay followed_by\n",
      "create new relationship DBS - followed_by -> FlashPay with confidence of 0.9385015964508057\n",
      "create new relationship Razer Pay - followed_by -> DBS with confidence of 0.9219642877578735\n",
      "DBS Razer Pay followed_by\n",
      "create new relationship DBS - followed_by -> Razer Pay with confidence of 0.9385015964508057\n",
      "create new relationship ShopeePay - followed_by -> DBS with confidence of 0.9219642877578735\n",
      "DBS ShopeePay followed_by\n",
      "create new relationship DBS - followed_by -> ShopeePay with confidence of 0.9385015964508057\n",
      "create new relationship Singtel Dash - followed_by -> DBS with confidence of 0.9219642877578735\n",
      "DBS Singtel Dash followed_by\n",
      "create new relationship DBS - followed_by -> Singtel Dash with confidence of 0.9385015964508057\n",
      "create new relationship Transit Link - followed_by -> DBS with confidence of 0.9219642877578735\n",
      "DBS Transit Link followed_by\n",
      "create new relationship DBS - followed_by -> Transit Link with confidence of 0.9385015964508057\n",
      "create new relationship annual - followed_by -> DBS with confidence of 0.9219642877578735\n",
      "DBS annual followed_by\n",
      "create new relationship DBS - followed_by -> annual with confidence of 0.9385015964508057\n",
      "create new node with name as DBS Points for Rewards and with type as ORG and sentiment with 0.0\n",
      "create new node with name as the Rewards Vouchers and with type as ORG and sentiment with 0.0\n",
      "create new node with name as monthly and with type as DATE and sentiment with 0.0\n",
      "create new node with name as DBS PayLah and with type as ORG and sentiment with 0.0\n",
      "create new relationship monthly - part_of -> Credit Card with confidence of 0.9445096850395203\n",
      "Credit_Card monthly part_of\n",
      "create new relationship Credit Card - part_of -> monthly with confidence of 0.9218611121177673\n",
      "create new node with name as a few days and with type as DATE and sentiment with 0.0\n",
      "create new node with name as 1 month and with type as DATE and sentiment with 0.0\n",
      "create new node with name as Annual and with type as DATE and sentiment with 0.0\n",
      "create new node with name as the following month's and with type as DATE and sentiment with 0.0\n",
      "create new relationship 1 month - part_of -> Credit Card with confidence of 0.8651261329650879\n",
      "create new relationship 1 month - followed_by -> the following month's with confidence of 0.9379753470420837\n",
      "the_following_month's 1 month followed_by\n",
      "create new relationship the following month's - followed_by -> 1 month with confidence of 0.8208729028701782\n",
      "create new relationship Annual - part_of -> Credit Card with confidence of 0.936951756477356\n",
      "Credit_Card Annual part_of\n",
      "create new relationship Credit Card - part_of -> Annual with confidence of 0.8984712362289429\n",
      "create new relationship Annual - followed_by -> the following month's with confidence of 0.8168022632598877\n",
      "create new relationship annual - part_of -> Credit Card with confidence of 0.974150538444519\n",
      "Credit_Card annual part_of\n",
      "create new relationship Credit Card - part_of -> annual with confidence of 0.963668167591095\n",
      "create new relationship annual - followed_by -> the following month's with confidence of 0.9342215657234192\n",
      "the_following_month's annual followed_by\n",
      "create new relationship the following month's - followed_by -> annual with confidence of 0.8812921047210693\n",
      "create new node with name as KrisFlyer and with type as ORG and sentiment with 0.0\n",
      "create new node with name as Qantas Points and with type as ORG and sentiment with 0.0\n",
      "create new node with name as 2 miles and with type as QUANTITY and sentiment with 0.0\n",
      "create new node with name as 5,000 and with type as CARDINAL and sentiment with 0.0\n",
      "create new node with name as 10,000 miles and with type as QUANTITY and sentiment with 0.0\n",
      "create new node with name as Air Asia and with type as ORG and sentiment with 0.0\n",
      "create new node with name as 500 and with type as CARDINAL and sentiment with 0.0\n",
      "create new node with name as 1,500 and with type as CARDINAL and sentiment with 0.0\n",
      "create new node with name as a S$27.25 administration and with type as GPE and sentiment with 0.0\n",
      "create new node with name as 31 Dec 2024 and with type as DATE and sentiment with 0.0\n",
      "create new node with name as noreferrer\">https://rewards.dbs.com</a and with type as ORG and sentiment with 0.0\n",
      "create new node with name as approximately 1 - 2 weeks and with type as CARDINAL and sentiment with 0.0\n",
      "create new relationship KrisFlyer - followed_by -> 5,000 with confidence of 0.8390920758247375\n",
      "create new relationship KrisFlyer - followed_by -> 3 with confidence of 0.9228342771530151\n",
      "3 KrisFlyer followed_by\n",
      "create new relationship 3 - followed_by -> KrisFlyer with confidence of 0.8478980660438538\n",
      "create new relationship Qantas Points - has_part -> 1 with confidence of 0.8222016096115112\n",
      "create new relationship Qantas Points - has_part -> Air Asia with confidence of 0.8108397126197815\n",
      "create new relationship Qantas Points - has_part -> DBS Point with confidence of 0.8807949423789978\n",
      "create new relationship Qantas Points - has_part -> 3 with confidence of 0.804230272769928\n",
      "create new relationship Qantas Points - has_part -> 500 with confidence of 0.8479778170585632\n",
      "create new relationship Qantas Points - part_of -> 1,500 with confidence of 0.9310262799263\n",
      "1,500 Qantas Points part_of\n",
      "create new relationship 1,500 - part_of -> Qantas Points with confidence of 0.9699512720108032\n",
      "create new relationship Qantas Points - part_of -> a S$27.25 administration with confidence of 0.9310262799263\n",
      "a_S$27.25_administration Qantas Points part_of\n",
      "create new relationship a S$27.25 administration - part_of -> Qantas Points with confidence of 0.9699512720108032\n",
      "create new relationship Qantas Points - part_of -> 31 Dec 2024 with confidence of 0.9310262799263\n",
      "31_Dec_2024 Qantas Points part_of\n",
      "create new relationship 31 Dec 2024 - part_of -> Qantas Points with confidence of 0.9699512720108032\n",
      "create new relationship Qantas Points - part_of -> noreferrer\">https://rewards.dbs.com</a with confidence of 0.9310262799263\n",
      "noreferrer\">https://rewards.dbs.com</a Qantas Points part_of\n",
      "create new relationship noreferrer\">https://rewards.dbs.com</a - part_of -> Qantas Points with confidence of 0.9699512720108032\n",
      "create new relationship Qantas Points - part_of -> approximately 1 - 2 weeks with confidence of 0.9310262799263\n",
      "approximately_1_-_2_weeks Qantas Points part_of\n",
      "create new relationship approximately 1 - 2 weeks - part_of -> Qantas Points with confidence of 0.9699512720108032\n",
      "create new relationship 1 - followed_by -> 5,000 with confidence of 0.9845436215400696\n",
      "5,000 1 followed_by\n",
      "create new relationship 5,000 - followed_by -> 1 with confidence of 0.9547110795974731\n",
      "create new relationship 1 - followed_by -> DBS Points with confidence of 0.8639518022537231\n",
      "create new relationship 1 - followed_by -> DBS Point with confidence of 0.8506357073783875\n",
      "create new relationship 1 - followed_by -> 3 with confidence of 0.9900804162025452\n",
      "3 1 followed_by\n",
      "create new relationship 3 - followed_by -> 1 with confidence of 0.9889544248580933\n",
      "create new relationship 1 - followed_by -> 500 with confidence of 0.8745476603507996\n",
      "500 1 followed_by\n",
      "create new relationship 500 - followed_by -> 1 with confidence of 0.8384647369384766\n",
      "create new relationship 5,000 - followed_by -> DBS Points with confidence of 0.9412329792976379\n",
      "DBS_Points 5,000 followed_by\n",
      "create new relationship DBS Points - followed_by -> 5,000 with confidence of 0.9191647171974182\n",
      "create new relationship 5,000 - followed_by -> 10,000 miles with confidence of 0.8876075744628906\n",
      "10,000_miles 5,000 followed_by\n",
      "create new relationship 10,000 miles - followed_by -> 5,000 with confidence of 0.890712559223175\n",
      "DBS_Point 5,000 followed_by\n",
      "create new relationship DBS Point - followed_by -> 5,000 with confidence of 0.9292778372764587\n",
      "create new relationship 5,000 - followed_by -> 3 with confidence of 0.9849516749382019\n",
      "3 5,000 followed_by\n",
      "create new relationship 3 - followed_by -> 5,000 with confidence of 0.9799267649650574\n",
      "create new relationship 5,000 - followed_by -> 500 with confidence of 0.9851539134979248\n",
      "500 5,000 followed_by\n",
      "create new relationship 500 - followed_by -> 5,000 with confidence of 0.9765375852584839\n",
      "1,500 5,000 followed_by\n",
      "create new relationship 1,500 - followed_by -> 5,000 with confidence of 0.8048588037490845\n",
      "a_S$27.25_administration 5,000 followed_by\n",
      "create new relationship a S$27.25 administration - followed_by -> 5,000 with confidence of 0.8048588037490845\n",
      "31_Dec_2024 5,000 followed_by\n",
      "create new relationship 31 Dec 2024 - followed_by -> 5,000 with confidence of 0.8048588037490845\n",
      "noreferrer\">https://rewards.dbs.com</a 5,000 followed_by\n",
      "create new relationship noreferrer\">https://rewards.dbs.com</a - followed_by -> 5,000 with confidence of 0.8048588037490845\n",
      "approximately_1_-_2_weeks 5,000 followed_by\n",
      "create new relationship approximately 1 - 2 weeks - followed_by -> 5,000 with confidence of 0.8048588037490845\n",
      "create new relationship DBS Points - said_to_be_the_same_as -> 10,000 miles with confidence of 0.9956335425376892\n",
      "10,000_miles DBS Points said_to_be_the_same_as\n",
      "create new relationship 10,000 miles - said_to_be_the_same_as -> DBS Points with confidence of 0.9853497743606567\n",
      "create new relationship DBS Points - followed_by -> DBS Point with confidence of 0.8428500890731812\n",
      "DBS_Point DBS Points followed_by\n",
      "create new relationship DBS Point - followed_by -> DBS Points with confidence of 0.9465136528015137\n",
      "create new relationship DBS Points - followed_by -> 3 with confidence of 0.9431597590446472\n",
      "3 DBS Points followed_by\n",
      "create new relationship 3 - followed_by -> DBS Points with confidence of 0.958913266658783\n",
      "create new relationship 10,000 miles - has_part -> Air Asia with confidence of 0.8170901536941528\n",
      "DBS_Point 10,000 miles said_to_be_the_same_as\n",
      "create new relationship DBS Point - said_to_be_the_same_as -> 10,000 miles with confidence of 0.9004341959953308\n",
      "create new relationship 10,000 miles - has_part -> 500 with confidence of 0.8100469708442688\n",
      "500 10,000 miles has_part\n",
      "create new relationship 500 - has_part -> 10,000 miles with confidence of 0.8547121286392212\n",
      "create new relationship 10,000 miles - has_part -> 1,500 with confidence of 0.9304569363594055\n",
      "1,500 10,000 miles has_part\n",
      "create new relationship 1,500 - has_part -> 10,000 miles with confidence of 0.9261484146118164\n",
      "create new relationship 10,000 miles - has_part -> a S$27.25 administration with confidence of 0.9304569363594055\n",
      "a_S$27.25_administration 10,000 miles has_part\n",
      "create new relationship a S$27.25 administration - has_part -> 10,000 miles with confidence of 0.9261484146118164\n",
      "create new relationship 10,000 miles - has_part -> 31 Dec 2024 with confidence of 0.9304569363594055\n",
      "31_Dec_2024 10,000 miles has_part\n",
      "create new relationship 31 Dec 2024 - has_part -> 10,000 miles with confidence of 0.9261484146118164\n",
      "create new relationship 10,000 miles - has_part -> noreferrer\">https://rewards.dbs.com</a with confidence of 0.9304569363594055\n",
      "noreferrer\">https://rewards.dbs.com</a 10,000 miles has_part\n",
      "create new relationship noreferrer\">https://rewards.dbs.com</a - has_part -> 10,000 miles with confidence of 0.9261484146118164\n",
      "create new relationship 10,000 miles - has_part -> approximately 1 - 2 weeks with confidence of 0.9304569363594055\n",
      "approximately_1_-_2_weeks 10,000 miles has_part\n",
      "create new relationship approximately 1 - 2 weeks - has_part -> 10,000 miles with confidence of 0.9261484146118164\n",
      "create new relationship Air Asia - has_part -> DBS Point with confidence of 0.8611277341842651\n",
      "DBS_Point Air Asia has_part\n",
      "create new relationship DBS Point - has_part -> Air Asia with confidence of 0.8252712488174438\n",
      "create new relationship Air Asia - followed_by -> 3 with confidence of 0.9140831828117371\n",
      "3 Air Asia followed_by\n",
      "create new relationship 3 - followed_by -> Air Asia with confidence of 0.9062797427177429\n",
      "create new relationship DBS Point - followed_by -> 3 with confidence of 0.9373305439949036\n",
      "3 DBS Point followed_by\n",
      "create new relationship 3 - followed_by -> DBS Point with confidence of 0.9557698965072632\n",
      "create new relationship DBS Point - has_part -> 1,500 with confidence of 0.831183671951294\n",
      "1,500 DBS Point has_part\n",
      "create new relationship 1,500 - has_part -> DBS Point with confidence of 0.8432498574256897\n",
      "create new relationship DBS Point - has_part -> a S$27.25 administration with confidence of 0.831183671951294\n",
      "a_S$27.25_administration DBS Point has_part\n",
      "create new relationship a S$27.25 administration - has_part -> DBS Point with confidence of 0.8432498574256897\n",
      "create new relationship DBS Point - has_part -> 31 Dec 2024 with confidence of 0.831183671951294\n",
      "31_Dec_2024 DBS Point has_part\n",
      "create new relationship 31 Dec 2024 - has_part -> DBS Point with confidence of 0.8432498574256897\n",
      "create new relationship DBS Point - has_part -> noreferrer\">https://rewards.dbs.com</a with confidence of 0.831183671951294\n",
      "noreferrer\">https://rewards.dbs.com</a DBS Point has_part\n",
      "create new relationship noreferrer\">https://rewards.dbs.com</a - has_part -> DBS Point with confidence of 0.8432498574256897\n",
      "create new relationship DBS Point - has_part -> approximately 1 - 2 weeks with confidence of 0.831183671951294\n",
      "approximately_1_-_2_weeks DBS Point has_part\n",
      "create new relationship approximately 1 - 2 weeks - has_part -> DBS Point with confidence of 0.8432498574256897\n",
      "create new relationship 3 - followed_by -> 500 with confidence of 0.9692606925964355\n",
      "500 3 followed_by\n",
      "create new relationship 500 - followed_by -> 3 with confidence of 0.9693183302879333\n",
      "create new relationship 3 - followed_by -> 1,500 with confidence of 0.934023380279541\n",
      "1,500 3 followed_by\n",
      "create new relationship 1,500 - followed_by -> 3 with confidence of 0.9617506861686707\n",
      "create new relationship 3 - followed_by -> a S$27.25 administration with confidence of 0.934023380279541\n",
      "a_S$27.25_administration 3 followed_by\n",
      "create new relationship a S$27.25 administration - followed_by -> 3 with confidence of 0.9617506861686707\n",
      "create new relationship 3 - followed_by -> 31 Dec 2024 with confidence of 0.934023380279541\n",
      "31_Dec_2024 3 followed_by\n",
      "create new relationship 31 Dec 2024 - followed_by -> 3 with confidence of 0.9617506861686707\n",
      "create new relationship 3 - followed_by -> noreferrer\">https://rewards.dbs.com</a with confidence of 0.934023380279541\n",
      "noreferrer\">https://rewards.dbs.com</a 3 followed_by\n",
      "create new relationship noreferrer\">https://rewards.dbs.com</a - followed_by -> 3 with confidence of 0.9617506861686707\n",
      "create new relationship 3 - followed_by -> approximately 1 - 2 weeks with confidence of 0.934023380279541\n",
      "approximately_1_-_2_weeks 3 followed_by\n",
      "create new relationship approximately 1 - 2 weeks - followed_by -> 3 with confidence of 0.9617506861686707\n",
      "create new node with name as PIN and with type as ORG and sentiment with 0.0\n",
      "create new node with name as Daily$ and with type as PRODUCT and sentiment with 0.0\n",
      "create new node with name as DBS/POSB and with type as ORG and sentiment with 0.0\n",
      "create new node with name as DBS Corporate Liability Card and with type as ORG and sentiment with 0.0\n",
      "create new node with name as DBS Saab Credit Card and with type as ORG and sentiment with 0.0\n",
      "create new node with name as DBS Takashimaya Card and with type as ORG and sentiment with 0.0\n",
      "create new node with name as DBS Credit/Debit Card and with type as ORG and sentiment with 0.0\n",
      "create new relationship DBS Saab Credit Card - instance_of -> DBS Credit/Debit Card with confidence of 0.9601203799247742\n",
      "DBS_Credit/Debit_Card DBS Saab Credit Card instance_of\n",
      "create new relationship DBS Credit/Debit Card - instance_of -> DBS Saab Credit Card with confidence of 0.9618926644325256\n",
      "create new relationship DBS Takashimaya Card - instance_of -> DBS Credit/Debit Card with confidence of 0.8073196411132812\n",
      "create new relationship DBS Esso Card - instance_of -> DBS Credit/Debit Card with confidence of 0.9617488384246826\n",
      "DBS_Credit/Debit_Card DBS Esso Card instance_of\n",
      "create new relationship DBS Credit/Debit Card - instance_of -> DBS Esso Card with confidence of 0.9107393622398376\n",
      "create new node with name as \"My DBS Points Details and with type as WORK_OF_ART and sentiment with 0.0\n",
      "create new node with name as 24 hours and with type as TIME and sentiment with 0.0\n",
      "create new node with name as Next working day and with type as DATE and sentiment with 0.0\n",
      "create new node with name as AXS Stations and with type as ORG and sentiment with 0.0\n",
      "create new node with name as InterBank and with type as ORG and sentiment with 0.0\n",
      "create new node with name as 3rd working day and with type as DATE and sentiment with 0.0\n",
      "create new relationship DBS/POSB - subsidiary -> InterBank with confidence of 0.9476721286773682\n",
      "InterBank DBS/POSB subsidiary\n",
      "create new relationship InterBank - subsidiary -> DBS/POSB with confidence of 0.9528747200965881\n",
      "create new node with name as 25 and with type as CARDINAL and sentiment with 0.0\n",
      "create new node with name as daily and with type as DATE and sentiment with 0.0\n",
      "create new node with name as S$2.50 and with type as GPE and sentiment with 0.0\n",
      "create new relationship 25 - followed_by -> daily with confidence of 0.8133096098899841\n",
      "daily 25 followed_by\n",
      "create new relationship daily - followed_by -> 25 with confidence of 0.8477885127067566\n",
      "S$2.50 daily has_part\n",
      "create new relationship S$2.50 - has_part -> daily with confidence of 0.8593531847000122\n",
      "create new node with name as 27.8% and with type as PERCENT and sentiment with 0.0\n",
      "create new node with name as 27 April 2021 and with type as DATE and sentiment with 0.0\n",
      "create new relationship 27.8% - part_of -> daily with confidence of 0.9234201312065125\n",
      "daily 27.8% part_of\n",
      "create new relationship daily - part_of -> 27.8% with confidence of 0.8106085062026978\n",
      "create new relationship daily - has_part -> S$2.50 with confidence of 0.9164763689041138\n",
      "27_April_2021 daily part_of\n",
      "create new relationship 27 April 2021 - part_of -> daily with confidence of 0.9565687775611877\n",
      "create new relationship S$2.50 - follows -> 27 April 2021 with confidence of 0.8117387294769287\n",
      "create new node with name as 25 June and with type as DATE and sentiment with 0.0\n",
      "create new node with name as 3% and with type as PERCENT and sentiment with 0.0\n",
      "create new node with name as p.a and with type as NORP and sentiment with 0.0\n",
      "create new node with name as the first working day and with type as DATE and sentiment with 0.0\n",
      "create new node with name as August and with type as DATE and sentiment with 0.0\n",
      "create new node with name as Bank and with type as ORG and sentiment with 0.0\n",
      "create new node with name as the following month and with type as DATE and sentiment with 0.0\n",
      "create new node with name as July and with type as DATE and sentiment with 0.0\n",
      "create new node with name as September and with type as DATE and sentiment with 0.0\n",
      "create new relationship 25 June - part_of -> Credit Card with confidence of 0.8993529677391052\n",
      "the_first_working_day 25 June follows\n",
      "create new relationship the first working day - follows -> 25 June with confidence of 0.8115957379341125\n",
      "August 25 June follows\n",
      "create new relationship August - follows -> 25 June with confidence of 0.8115957379341125\n",
      "Bank 25 June follows\n",
      "create new relationship Bank - follows -> 25 June with confidence of 0.8115957379341125\n",
      "the_following_month 25 June follows\n",
      "create new relationship the following month - follows -> 25 June with confidence of 0.8115957379341125\n",
      "July 25 June follows\n",
      "create new relationship July - follows -> 25 June with confidence of 0.8115957379341125\n",
      "September 25 June follows\n",
      "create new relationship September - follows -> 25 June with confidence of 0.8115957379341125\n",
      "create new relationship Credit Card - part_of -> 3% with confidence of 0.8966318964958191\n",
      "3% Credit Card part_of\n",
      "create new relationship 3% - part_of -> Credit Card with confidence of 0.9488418102264404\n",
      "create new relationship Credit Card - part_of -> p.a with confidence of 0.87530118227005\n",
      "p.a Credit Card part_of\n",
      "create new relationship p.a - part_of -> Credit Card with confidence of 0.9251477718353271\n",
      "create new relationship Credit Card - part_of -> the first working day with confidence of 0.9330798387527466\n",
      "the_first_working_day Credit Card part_of\n",
      "create new relationship the first working day - part_of -> Credit Card with confidence of 0.9633850455284119\n",
      "create new relationship Credit Card - part_of -> August with confidence of 0.9330798387527466\n",
      "August Credit Card part_of\n",
      "create new relationship August - part_of -> Credit Card with confidence of 0.9633850455284119\n",
      "create new relationship Credit Card - part_of -> Bank with confidence of 0.9330798387527466\n",
      "Bank Credit Card part_of\n",
      "create new relationship Bank - part_of -> Credit Card with confidence of 0.9633850455284119\n",
      "create new relationship Credit Card - part_of -> the following month with confidence of 0.9330798387527466\n",
      "the_following_month Credit Card part_of\n",
      "create new relationship the following month - part_of -> Credit Card with confidence of 0.9633850455284119\n",
      "create new relationship Credit Card - part_of -> July with confidence of 0.9330798387527466\n",
      "July Credit Card part_of\n",
      "create new relationship July - part_of -> Credit Card with confidence of 0.9633850455284119\n",
      "create new relationship Credit Card - part_of -> September with confidence of 0.9330798387527466\n",
      "September Credit Card part_of\n",
      "create new relationship September - part_of -> Credit Card with confidence of 0.9633850455284119\n",
      "the_first_working_day 3% followed_by\n",
      "create new relationship the first working day - followed_by -> 3% with confidence of 0.8389431238174438\n",
      "August 3% followed_by\n",
      "create new relationship August - followed_by -> 3% with confidence of 0.8389431238174438\n",
      "Bank 3% followed_by\n",
      "create new relationship Bank - followed_by -> 3% with confidence of 0.8389431238174438\n",
      "the_following_month 3% followed_by\n",
      "create new relationship the following month - followed_by -> 3% with confidence of 0.8389431238174438\n",
      "July 3% followed_by\n",
      "create new relationship July - followed_by -> 3% with confidence of 0.8389431238174438\n",
      "September 3% followed_by\n",
      "create new relationship September - followed_by -> 3% with confidence of 0.8389431238174438\n",
      "create new node with name as the 1 month and with type as DATE and sentiment with 0.0\n",
      "create new node with name as October and with type as DATE and sentiment with 0.0\n",
      "create new relationship the 1 month - followed_by -> 1 month with confidence of 0.9743942618370056\n",
      "1_month the 1 month followed_by\n",
      "create new relationship 1 month - followed_by -> the 1 month with confidence of 0.9360613226890564\n",
      "October 1 month followed_by\n",
      "create new relationship October - followed_by -> 1 month with confidence of 0.842919647693634\n",
      "create new node with name as full each month and with type as DATE and sentiment with 0.0\n",
      "create new node with name as each month and with type as DATE and sentiment with 0.0\n",
      "create new relationship full each month - followed_by -> each month with confidence of 0.9685067534446716\n",
      "each_month full each month followed_by\n",
      "create new relationship each month - followed_by -> full each month with confidence of 0.9126200079917908\n",
      "create new node with name as 1800 and with type as CARDINAL and sentiment with 0.0\n",
      "create new node with name as 65 and with type as CARDINAL and sentiment with 0.0\n",
      "create new node with name as 6 to 8 weeks and with type as DATE and sentiment with 0.0\n",
      "create new relationship 1800 - followed_by -> 65 with confidence of 0.9508926868438721\n",
      "65 1800 followed_by\n",
      "create new relationship 65 - followed_by -> 1800 with confidence of 0.9119148254394531\n",
      "create new node with name as 24-hour and with type as TIME and sentiment with 0.0\n",
      "create new node with name as Customer Service Centre and with type as FAC and sentiment with 0.0\n",
      "create new relationship 24-hour - instance_of -> Customer Service Centre with confidence of 0.8026913404464722\n",
      "create new node with name as DBS Cards and with type as ORG and sentiment with 0.0\n",
      "create new node with name as Orchard Road and with type as FAC and sentiment with 0.0\n",
      "create new node with name as P.O. Box 360 and with type as FAC and sentiment with 0.0\n",
      "create new node with name as 912312 and with type as CARDINAL and sentiment with 0.0\n",
      "create new node with name as half and with type as CARDINAL and sentiment with 0.0\n",
      "create new relationship DBS Cards - headquarters_location -> Orchard Road with confidence of 0.9921161532402039\n",
      "Orchard_Road DBS Cards headquarters_location\n",
      "create new relationship Orchard Road - headquarters_location -> DBS Cards with confidence of 0.9895097017288208\n",
      "create new relationship DBS Cards - subsidiary -> P.O. Box 360 with confidence of 0.8724002242088318\n",
      "P.O._Box_360 DBS Cards subsidiary\n",
      "create new relationship P.O. Box 360 - subsidiary -> DBS Cards with confidence of 0.8932150602340698\n",
      "create new relationship DBS Cards - headquarters_location -> Singapore with confidence of 0.9301686882972717\n",
      "create new relationship DBS Cards - headquarters_location -> 912312 with confidence of 0.8192433714866638\n",
      "create new relationship DBS Cards - subsidiary -> half with confidence of 0.9059246778488159\n",
      "half DBS Cards subsidiary\n",
      "create new relationship half - subsidiary -> DBS Cards with confidence of 0.9149022698402405\n",
      "create new relationship DBS Cards - subsidiary -> monthly with confidence of 0.9059246778488159\n",
      "monthly DBS Cards subsidiary\n",
      "create new relationship monthly - subsidiary -> DBS Cards with confidence of 0.9149022698402405\n",
      "create new relationship Orchard Road - located_in_the_administrative_territorial_entity -> Singapore with confidence of 0.9499751925468445\n",
      "Singapore Orchard Road located_in_the_administrative_territorial_entity\n",
      "create new relationship Singapore - located_in_the_administrative_territorial_entity -> Orchard Road with confidence of 0.954057514667511\n",
      "create new relationship Orchard Road - located_in_the_administrative_territorial_entity -> 912312 with confidence of 0.8029608726501465\n",
      "912312 Orchard Road located_in_the_administrative_territorial_entity\n",
      "create new relationship 912312 - located_in_the_administrative_territorial_entity -> Orchard Road with confidence of 0.8732746243476868\n",
      "create new relationship P.O. Box 360 - located_in_the_administrative_territorial_entity -> Singapore with confidence of 0.9436569213867188\n",
      "Singapore P.O. Box 360 located_in_the_administrative_territorial_entity\n",
      "create new relationship Singapore - located_in_the_administrative_territorial_entity -> P.O. Box 360 with confidence of 0.9202204346656799\n",
      "create new relationship P.O. Box 360 - part_of -> half with confidence of 0.8849115967750549\n",
      "half P.O. Box 360 part_of\n",
      "create new relationship half - part_of -> P.O. Box 360 with confidence of 0.9140729904174805\n",
      "create new relationship P.O. Box 360 - part_of -> monthly with confidence of 0.8849115967750549\n",
      "monthly P.O. Box 360 part_of\n",
      "create new relationship monthly - part_of -> P.O. Box 360 with confidence of 0.9140729904174805\n",
      "create new relationship Singapore - part_of -> 912312 with confidence of 0.8788182735443115\n",
      "912312 Singapore part_of\n",
      "create new relationship 912312 - part_of -> Singapore with confidence of 0.9275113344192505\n",
      "create new node with name as 6327 2265 and with type as CARDINAL and sentiment with 0.0\n",
      "create new relationship 1800 - followed_by -> 65 with confidence of 0.9479461908340454\n",
      "6327_2265 1800 follows\n",
      "create new relationship 6327 2265 - follows -> 1800 with confidence of 0.8540387153625488\n",
      "create new node with name as DBS/POSB Digibank and with type as ORG and sentiment with 0.0\n",
      "create new node with name as Mobile Banking and with type as ORG and sentiment with 0.0\n",
      "create new relationship DBS/POSB Digibank - developer -> href=\"https://www.dbs.com.sg with confidence of 0.9206638336181641\n",
      "href=\"https://www.dbs.com.sg DBS/POSB Digibank developer\n",
      "create new relationship href=\"https://www.dbs.com.sg - developer -> DBS/POSB Digibank with confidence of 0.8392268419265747\n",
      "create new relationship Mobile Banking - part_of -> href=\"https://www.dbs.com.sg with confidence of 0.830636739730835\n",
      "href=\"https://www.dbs.com.sg Mobile Banking part_of\n",
      "create new relationship href=\"https://www.dbs.com.sg - part_of -> Mobile Banking with confidence of 0.9257042407989502\n",
      "create new node with name as 8% and with type as PERCENT and sentiment with 0.0\n",
      "create new node with name as S$15.00 and with type as NORP and sentiment with 0.0\n",
      "create new node with name as Cash Advance and with type as ORG and sentiment with 0.0\n",
      "create new node with name as 28.5% and with type as PERCENT and sentiment with 0.0\n",
      "create new relationship 8% - has_part -> Cash Advance with confidence of 0.887680172920227\n",
      "Cash_Advance 8% has_part\n",
      "create new relationship Cash Advance - has_part -> 8% with confidence of 0.8406420946121216\n",
      "create new relationship 8% - followed_by -> 28.5% with confidence of 0.8004482984542847\n",
      "create new node with name as DBS/ POSB Balance Transfer and with type as ORG and sentiment with 0.0\n",
      "create new node with name as 0% and with type as PERCENT and sentiment with 0.0\n",
      "create new node with name as 6 or 12 months and with type as DATE and sentiment with 0.0\n",
      "create new relationship DBS/ POSB Balance Transfer - has_part -> 0% with confidence of 0.8272745609283447\n",
      "create new relationship DBS/ POSB Balance Transfer - follows -> 3 with confidence of 0.9241433143615723\n",
      "3 DBS/ POSB Balance Transfer follows\n",
      "create new relationship 3 - follows -> DBS/ POSB Balance Transfer with confidence of 0.9174800515174866\n",
      "create new relationship 0% - has_part -> 6 or 12 months with confidence of 0.8475841283798218\n",
      "create new relationship 3 - follows -> href=\"https://www.dbs.com.sg with confidence of 0.9824601411819458\n",
      "href=\"https://www.dbs.com.sg 3 follows\n",
      "create new relationship href=\"https://www.dbs.com.sg - follows -> 3 with confidence of 0.9843375086784363\n",
      "create new node with name as EMV and with type as ORG and sentiment with 0.0\n",
      "create new node with name as Europay and with type as ORG and sentiment with 0.0\n",
      "create new node with name as MasterCard and with type as ORG and sentiment with 0.0\n",
      "create new node with name as Visa and with type as ORG and sentiment with 0.0\n",
      "create new relationship EMV - said_to_be_the_same_as -> Europay with confidence of 0.9963834285736084\n",
      "Europay EMV said_to_be_the_same_as\n",
      "create new relationship Europay - said_to_be_the_same_as -> EMV with confidence of 0.9956472516059875\n",
      "create new relationship EMV - said_to_be_the_same_as -> MasterCard with confidence of 0.953921914100647\n",
      "MasterCard EMV said_to_be_the_same_as\n",
      "create new relationship MasterCard - said_to_be_the_same_as -> EMV with confidence of 0.9482921957969666\n",
      "create new relationship EMV - said_to_be_the_same_as -> Visa with confidence of 0.9456604719161987\n",
      "Visa EMV said_to_be_the_same_as\n",
      "create new relationship Visa - said_to_be_the_same_as -> EMV with confidence of 0.9634796977043152\n",
      "create new relationship Europay - subsidiary -> MasterCard with confidence of 0.9087056517601013\n",
      "MasterCard Europay subsidiary\n",
      "create new relationship MasterCard - subsidiary -> Europay with confidence of 0.8143017292022705\n",
      "create new relationship Europay - subsidiary -> Visa with confidence of 0.8587913513183594\n",
      "create new relationship MasterCard - subsidiary -> Visa with confidence of 0.8870516419410706\n",
      "create new node with name as the EMV Chip Card and with type as EVENT and sentiment with 0.0\n",
      "create new node with name as MAS and with type as ORG and sentiment with 0.0\n",
      "create new relationship the EMV Chip Card - part_of -> MAS with confidence of 0.8144178986549377\n",
      "create new node with name as EMV Chip Card and with type as ORG and sentiment with 0.0\n",
      "create new node with name as EMV Chip Cards and with type as ORG and sentiment with 0.0\n",
      "create new node with name as ATMs and with type as ORG and sentiment with 0.0\n",
      "create new node with name as DBS Current/Savings and with type as ORG and sentiment with 0.0\n",
      "create new node with name as Credit/Debit Card and with type as ORG and sentiment with 0.0\n",
      "create new relationship EMV Chip Card - part_of -> ATMs with confidence of 0.8041132688522339\n",
      "create new node with name as 16 and with type as CARDINAL and sentiment with 0.0\n",
      "create new node with name as Card and with type as ORG and sentiment with 0.0\n",
      "create new relationship EMV Chip Card - instance_of -> Card with confidence of 0.9974321722984314\n",
      "Card EMV Chip Card instance_of\n",
      "create new relationship Card - instance_of -> EMV Chip Card with confidence of 0.9860833287239075\n",
      "create new node with name as Cardholders and with type as ORG and sentiment with 0.0\n",
      "create new node with name as DBS/POSB Cards and with type as ORG and sentiment with 0.0\n",
      "create new node with name as DBS Commercial Cards and with type as ORG and sentiment with 0.0\n",
      "create new relationship DBS/POSB Cards - has_part -> DBS Commercial Cards with confidence of 0.8164998888969421\n",
      "DBS_Commercial_Cards DBS/POSB Cards has_part\n",
      "create new relationship DBS Commercial Cards - has_part -> DBS/POSB Cards with confidence of 0.8654883503913879\n",
      "create new node with name as digibank mobile and with type as ORG and sentiment with 0.0\n",
      "create new node with name as SMS Banking and with type as ORG and sentiment with 0.0\n",
      "create new node with name as Video Teller Machine and with type as ORG and sentiment with 0.0\n",
      "create new relationship SMS Banking - part_of -> Video Teller Machine with confidence of 0.9236977100372314\n",
      "Video_Teller_Machine SMS Banking part_of\n",
      "create new relationship Video Teller Machine - part_of -> SMS Banking with confidence of 0.9698532819747925\n",
      "create new node with name as CDA Customers and with type as ORG and sentiment with 0.0\n",
      "create new node with name as One and with type as CARDINAL and sentiment with 0.0\n",
      "create new node with name as 77767 and with type as CARDINAL and sentiment with 0.0\n",
      "create new node with name as SG and with type as ORG and sentiment with 0.0\n",
      "create new node with name as Singaporean/PR Trustee & Child and with type as ORG and sentiment with 0.0\n",
      "create new node with name as one and with type as CARDINAL and sentiment with 0.0\n",
      "create new node with name as ATM and with type as ORG and sentiment with 0.0\n",
      "create new node with name as Mail-in Activation Slip and with type as ORG and sentiment with 0.0\n",
      "create new node with name as 5 working days and with type as DATE and sentiment with 0.0\n",
      "5_working_days ATM part_of\n",
      "create new relationship 5 working days - part_of -> ATM with confidence of 0.8380030989646912\n",
      "create new relationship ATM - subsidiary -> Bank with confidence of 0.9709348082542419\n",
      "Bank ATM subsidiary\n",
      "create new relationship Bank - subsidiary -> ATM with confidence of 0.9562807083129883\n",
      "create new node with name as Telephone PIN and with type as ORG and sentiment with 0.0\n",
      "create new node with name as 24-hours and with type as TIME and sentiment with 0.0\n",
      "create new node with name as Customer Service and with type as ORG and sentiment with 0.0\n",
      "create new relationship one - has_part -> Telephone PIN with confidence of 0.950673520565033\n",
      "Telephone_PIN one has_part\n",
      "create new relationship Telephone PIN - has_part -> one with confidence of 0.9348275065422058\n",
      "create new node with name as DBS digibot & Phone Banking and with type as ORG and sentiment with 0.0\n",
      "create new node with name as 2345 hrs to and with type as TIME and sentiment with 0.0\n",
      "create new node with name as 0030 hrs and and with type as TIME and sentiment with 0.0\n",
      "create new node with name as 0230 hrs to and with type as TIME and sentiment with 0.0\n",
      "create new node with name as Sunday and with type as DATE and sentiment with 0.0\n",
      "create new node with name as 3 working days and with type as DATE and sentiment with 0.0\n",
      "create new node with name as DBS Altitude Credit Card/DBS Vantage and with type as ORG and sentiment with 0.0\n",
      "create new node with name as S$0.0388 and with type as ORG and sentiment with 0.0\n",
      "create new relationship DBS digibot & Phone Banking - followed_by -> 2345 hrs to with confidence of 0.9251436591148376\n",
      "2345_hrs_to DBS digibot & Phone Banking followed_by\n",
      "create new relationship 2345 hrs to - followed_by -> DBS digibot & Phone Banking with confidence of 0.9249846339225769\n",
      "create new relationship DBS digibot & Phone Banking - followed_by -> 0030 hrs and with confidence of 0.8707619309425354\n",
      "create new relationship DBS digibot & Phone Banking - followed_by -> 0230 hrs to with confidence of 0.95933997631073\n",
      "0230_hrs_to DBS digibot & Phone Banking followed_by\n",
      "create new relationship 0230 hrs to - followed_by -> DBS digibot & Phone Banking with confidence of 0.958773136138916\n",
      "create new relationship DBS digibot & Phone Banking - part_of -> daily with confidence of 0.937154233455658\n",
      "daily DBS digibot & Phone Banking part_of\n",
      "create new relationship daily - part_of -> DBS digibot & Phone Banking with confidence of 0.8957347869873047\n",
      "create new relationship DBS digibot & Phone Banking - operating_system -> 3 working days with confidence of 0.8294091820716858\n",
      "3_working_days DBS digibot & Phone Banking operating_system\n",
      "create new relationship 3 working days - operating_system -> DBS digibot & Phone Banking with confidence of 0.8750630617141724\n",
      "create new relationship DBS digibot & Phone Banking - operating_system -> DBS Altitude Credit Card/DBS Vantage with confidence of 0.8294091820716858\n",
      "DBS_Altitude_Credit_Card/DBS_Vantage DBS digibot & Phone Banking operating_system\n",
      "create new relationship DBS Altitude Credit Card/DBS Vantage - operating_system -> DBS digibot & Phone Banking with confidence of 0.8750630617141724\n",
      "create new relationship DBS digibot & Phone Banking - operating_system -> DBS Points with confidence of 0.8294091820716858\n",
      "DBS_Points DBS digibot & Phone Banking operating_system\n",
      "create new relationship DBS Points - operating_system -> DBS digibot & Phone Banking with confidence of 0.8750630617141724\n",
      "create new relationship DBS digibot & Phone Banking - operating_system -> annual with confidence of 0.8294091820716858\n",
      "annual DBS digibot & Phone Banking operating_system\n",
      "create new relationship annual - operating_system -> DBS digibot & Phone Banking with confidence of 0.8750630617141724\n",
      "create new relationship DBS digibot & Phone Banking - operating_system -> S$0.0388 with confidence of 0.8294091820716858\n",
      "S$0.0388 DBS digibot & Phone Banking operating_system\n",
      "create new relationship S$0.0388 - operating_system -> DBS digibot & Phone Banking with confidence of 0.8750630617141724\n",
      "create new relationship DBS digibot & Phone Banking - operating_system -> DBS Point with confidence of 0.8294091820716858\n",
      "DBS_Point DBS digibot & Phone Banking operating_system\n",
      "create new relationship DBS Point - operating_system -> DBS digibot & Phone Banking with confidence of 0.8750630617141724\n",
      "create new relationship DBS digibot & Phone Banking - operating_system -> href=\"https://www.dbs.com.sg with confidence of 0.8294091820716858\n",
      "href=\"https://www.dbs.com.sg DBS digibot & Phone Banking operating_system\n",
      "create new relationship href=\"https://www.dbs.com.sg - operating_system -> DBS digibot & Phone Banking with confidence of 0.8750630617141724\n",
      "create new relationship 2345 hrs to - followed_by -> 0030 hrs and with confidence of 0.9789620041847229\n",
      "0030_hrs_and 2345 hrs to followed_by\n",
      "create new relationship 0030 hrs and - followed_by -> 2345 hrs to with confidence of 0.9689981341362\n",
      "create new relationship 2345 hrs to - followed_by -> 0230 hrs to with confidence of 0.9893614649772644\n",
      "0230_hrs_to 2345 hrs to followed_by\n",
      "create new relationship 0230 hrs to - followed_by -> 2345 hrs to with confidence of 0.988761842250824\n",
      "create new relationship 2345 hrs to - followed_by -> Sunday with confidence of 0.9745851159095764\n",
      "Sunday 2345 hrs to followed_by\n",
      "create new relationship Sunday - followed_by -> 2345 hrs to with confidence of 0.9666741490364075\n",
      "create new relationship 2345 hrs to - followed_by -> 3 working days with confidence of 0.8712251782417297\n",
      "3_working_days 2345 hrs to followed_by\n",
      "create new relationship 3 working days - followed_by -> 2345 hrs to with confidence of 0.8441759943962097\n",
      "create new relationship 2345 hrs to - followed_by -> DBS Altitude Credit Card/DBS Vantage with confidence of 0.8712251782417297\n",
      "DBS_Altitude_Credit_Card/DBS_Vantage 2345 hrs to followed_by\n",
      "create new relationship DBS Altitude Credit Card/DBS Vantage - followed_by -> 2345 hrs to with confidence of 0.8441759943962097\n",
      "create new relationship 2345 hrs to - followed_by -> DBS Points with confidence of 0.8712251782417297\n",
      "DBS_Points 2345 hrs to followed_by\n",
      "create new relationship DBS Points - followed_by -> 2345 hrs to with confidence of 0.8441759943962097\n",
      "create new relationship 2345 hrs to - followed_by -> annual with confidence of 0.8712251782417297\n",
      "annual 2345 hrs to followed_by\n",
      "create new relationship annual - followed_by -> 2345 hrs to with confidence of 0.8441759943962097\n",
      "create new relationship 2345 hrs to - followed_by -> S$0.0388 with confidence of 0.8712251782417297\n",
      "S$0.0388 2345 hrs to followed_by\n",
      "create new relationship S$0.0388 - followed_by -> 2345 hrs to with confidence of 0.8441759943962097\n",
      "create new relationship 2345 hrs to - followed_by -> DBS Point with confidence of 0.8712251782417297\n",
      "DBS_Point 2345 hrs to followed_by\n",
      "create new relationship DBS Point - followed_by -> 2345 hrs to with confidence of 0.8441759943962097\n",
      "create new relationship 2345 hrs to - followed_by -> href=\"https://www.dbs.com.sg with confidence of 0.8712251782417297\n",
      "href=\"https://www.dbs.com.sg 2345 hrs to followed_by\n",
      "create new relationship href=\"https://www.dbs.com.sg - followed_by -> 2345 hrs to with confidence of 0.8441759943962097\n",
      "create new relationship 0030 hrs and - followed_by -> 0230 hrs to with confidence of 0.9917327165603638\n",
      "0230_hrs_to 0030 hrs and followed_by\n",
      "create new relationship 0230 hrs to - followed_by -> 0030 hrs and with confidence of 0.9920080900192261\n",
      "create new relationship 0030 hrs and - followed_by -> Sunday with confidence of 0.9845222234725952\n",
      "Sunday 0030 hrs and followed_by\n",
      "create new relationship Sunday - followed_by -> 0030 hrs and with confidence of 0.9875895380973816\n",
      "create new relationship 0030 hrs and - followed_by -> 3 working days with confidence of 0.9924169778823853\n",
      "3_working_days 0030 hrs and followed_by\n",
      "create new relationship 3 working days - followed_by -> 0030 hrs and with confidence of 0.9910798668861389\n",
      "create new relationship 0030 hrs and - followed_by -> DBS Altitude Credit Card/DBS Vantage with confidence of 0.9924169778823853\n",
      "DBS_Altitude_Credit_Card/DBS_Vantage 0030 hrs and followed_by\n",
      "create new relationship DBS Altitude Credit Card/DBS Vantage - followed_by -> 0030 hrs and with confidence of 0.9910798668861389\n",
      "create new relationship 0030 hrs and - followed_by -> DBS Points with confidence of 0.9924169778823853\n",
      "DBS_Points 0030 hrs and followed_by\n",
      "create new relationship DBS Points - followed_by -> 0030 hrs and with confidence of 0.9910798668861389\n",
      "create new relationship 0030 hrs and - followed_by -> annual with confidence of 0.9924169778823853\n",
      "annual 0030 hrs and followed_by\n",
      "create new relationship annual - followed_by -> 0030 hrs and with confidence of 0.9910798668861389\n",
      "create new relationship 0030 hrs and - followed_by -> S$0.0388 with confidence of 0.9924169778823853\n",
      "S$0.0388 0030 hrs and followed_by\n",
      "create new relationship S$0.0388 - followed_by -> 0030 hrs and with confidence of 0.9910798668861389\n",
      "create new relationship 0030 hrs and - followed_by -> DBS Point with confidence of 0.9924169778823853\n",
      "DBS_Point 0030 hrs and followed_by\n",
      "create new relationship DBS Point - followed_by -> 0030 hrs and with confidence of 0.9910798668861389\n",
      "create new relationship 0030 hrs and - followed_by -> href=\"https://www.dbs.com.sg with confidence of 0.9924169778823853\n",
      "href=\"https://www.dbs.com.sg 0030 hrs and followed_by\n",
      "create new relationship href=\"https://www.dbs.com.sg - followed_by -> 0030 hrs and with confidence of 0.9910798668861389\n",
      "create new relationship 0230 hrs to - followed_by -> daily with confidence of 0.9618868231773376\n",
      "daily 0230 hrs to followed_by\n",
      "create new relationship daily - followed_by -> 0230 hrs to with confidence of 0.9672611355781555\n",
      "create new relationship 0230 hrs to - followed_by -> Sunday with confidence of 0.9880110621452332\n",
      "Sunday 0230 hrs to followed_by\n",
      "create new relationship Sunday - followed_by -> 0230 hrs to with confidence of 0.989700198173523\n",
      "create new relationship 0230 hrs to - followed_by -> 3 working days with confidence of 0.9924877882003784\n",
      "3_working_days 0230 hrs to followed_by\n",
      "create new relationship 3 working days - followed_by -> 0230 hrs to with confidence of 0.9928861260414124\n",
      "create new relationship 0230 hrs to - followed_by -> DBS Altitude Credit Card/DBS Vantage with confidence of 0.9924877882003784\n",
      "DBS_Altitude_Credit_Card/DBS_Vantage 0230 hrs to followed_by\n",
      "create new relationship DBS Altitude Credit Card/DBS Vantage - followed_by -> 0230 hrs to with confidence of 0.9928861260414124\n",
      "create new relationship 0230 hrs to - followed_by -> DBS Points with confidence of 0.9924877882003784\n",
      "DBS_Points 0230 hrs to followed_by\n",
      "create new relationship DBS Points - followed_by -> 0230 hrs to with confidence of 0.9928861260414124\n",
      "create new relationship 0230 hrs to - followed_by -> annual with confidence of 0.9924877882003784\n",
      "annual 0230 hrs to followed_by\n",
      "create new relationship annual - followed_by -> 0230 hrs to with confidence of 0.9928861260414124\n",
      "create new relationship 0230 hrs to - followed_by -> S$0.0388 with confidence of 0.9924877882003784\n",
      "S$0.0388 0230 hrs to followed_by\n",
      "create new relationship S$0.0388 - followed_by -> 0230 hrs to with confidence of 0.9928861260414124\n",
      "create new relationship 0230 hrs to - followed_by -> DBS Point with confidence of 0.9924877882003784\n",
      "DBS_Point 0230 hrs to followed_by\n",
      "create new relationship DBS Point - followed_by -> 0230 hrs to with confidence of 0.9928861260414124\n",
      "create new relationship 0230 hrs to - followed_by -> href=\"https://www.dbs.com.sg with confidence of 0.9924877882003784\n",
      "href=\"https://www.dbs.com.sg 0230 hrs to followed_by\n",
      "create new relationship href=\"https://www.dbs.com.sg - followed_by -> 0230 hrs to with confidence of 0.9928861260414124\n",
      "create new relationship daily - part_of -> 3 working days with confidence of 0.8924529552459717\n",
      "3_working_days daily part_of\n",
      "create new relationship 3 working days - part_of -> daily with confidence of 0.9337422847747803\n",
      "create new relationship daily - part_of -> DBS Altitude Credit Card/DBS Vantage with confidence of 0.8924529552459717\n",
      "DBS_Altitude_Credit_Card/DBS_Vantage daily part_of\n",
      "create new relationship DBS Altitude Credit Card/DBS Vantage - part_of -> daily with confidence of 0.9337422847747803\n",
      "create new relationship daily - part_of -> DBS Points with confidence of 0.8924529552459717\n",
      "DBS_Points daily part_of\n",
      "create new relationship DBS Points - part_of -> daily with confidence of 0.9337422847747803\n",
      "create new relationship daily - part_of -> annual with confidence of 0.8924529552459717\n",
      "annual daily part_of\n",
      "create new relationship annual - part_of -> daily with confidence of 0.9337422847747803\n",
      "create new relationship daily - part_of -> S$0.0388 with confidence of 0.8924529552459717\n",
      "S$0.0388 daily part_of\n",
      "create new relationship S$0.0388 - part_of -> daily with confidence of 0.9337422847747803\n",
      "create new relationship daily - part_of -> DBS Point with confidence of 0.8924529552459717\n",
      "DBS_Point daily part_of\n",
      "create new relationship DBS Point - part_of -> daily with confidence of 0.9337422847747803\n",
      "create new relationship daily - part_of -> href=\"https://www.dbs.com.sg with confidence of 0.8924529552459717\n",
      "href=\"https://www.dbs.com.sg daily part_of\n",
      "create new relationship href=\"https://www.dbs.com.sg - part_of -> daily with confidence of 0.9337422847747803\n",
      "3_working_days Sunday followed_by\n",
      "create new relationship 3 working days - followed_by -> Sunday with confidence of 0.8108917474746704\n",
      "DBS_Altitude_Credit_Card/DBS_Vantage Sunday followed_by\n",
      "create new relationship DBS Altitude Credit Card/DBS Vantage - followed_by -> Sunday with confidence of 0.8108917474746704\n",
      "DBS_Points Sunday followed_by\n",
      "create new relationship DBS Points - followed_by -> Sunday with confidence of 0.8108917474746704\n",
      "annual Sunday followed_by\n",
      "create new relationship annual - followed_by -> Sunday with confidence of 0.8108917474746704\n",
      "S$0.0388 Sunday followed_by\n",
      "create new relationship S$0.0388 - followed_by -> Sunday with confidence of 0.8108917474746704\n",
      "DBS_Point Sunday followed_by\n",
      "create new relationship DBS Point - followed_by -> Sunday with confidence of 0.8108917474746704\n",
      "href=\"https://www.dbs.com.sg Sunday followed_by\n",
      "create new relationship href=\"https://www.dbs.com.sg - followed_by -> Sunday with confidence of 0.8108917474746704\n",
      "create new node with name as Card Statements and with type as ORG and sentiment with 0.0\n",
      "create new relationship Card Statements - has_part -> href=\"https://www.dbs.com.sg with confidence of 0.9204323887825012\n",
      "href=\"https://www.dbs.com.sg Card Statements has_part\n",
      "create new relationship href=\"https://www.dbs.com.sg - has_part -> Card Statements with confidence of 0.9306463599205017\n",
      "create new node with name as ATM Card and with type as ORG and sentiment with 0.0\n",
      "href=\"https://www.dbs.com.sg DBS developer\n",
      "create new relationship href=\"https://www.dbs.com.sg - developer -> DBS with confidence of 0.8187897801399231\n",
      "create new node with name as Mobile and with type as GPE and sentiment with 0.0\n",
      "create new node with name as Visa Gold and with type as ORG and sentiment with 0.0\n",
      "create new node with name as Visa Platinum and with type as ORG and sentiment with 0.0\n",
      "create new node with name as 2 weeks and with type as DATE and sentiment with 0.0\n",
      "create new relationship Visa - followed_by -> Visa Gold with confidence of 0.9376882910728455\n",
      "create new relationship Visa - followed_by -> Visa Platinum with confidence of 0.948495090007782\n",
      "create new relationship Visa - follows -> 2 weeks with confidence of 0.960252583026886\n",
      "2_weeks Visa follows\n",
      "create new relationship 2 weeks - follows -> Visa with confidence of 0.968775749206543\n",
      "create new relationship Visa Gold - followed_by -> Visa Platinum with confidence of 0.9872987866401672\n",
      "Visa_Platinum Visa Gold followed_by\n",
      "create new relationship Visa Platinum - followed_by -> Visa Gold with confidence of 0.977668285369873\n",
      "create new relationship Visa Platinum - followed_by -> 2 weeks with confidence of 0.9420592188835144\n",
      "2_weeks Visa Platinum followed_by\n",
      "create new relationship 2 weeks - followed_by -> Visa Platinum with confidence of 0.9633200168609619\n",
      "create new node with name as NEFT and with type as ORG and sentiment with 0.0\n",
      "create new node with name as half-hourly and with type as TIME and sentiment with 0.0\n",
      "create new node with name as between 8 am to 4.30 pm and with type as TIME and sentiment with 0.0\n",
      "create new node with name as all working days and with type as DATE and sentiment with 0.0\n",
      "create new node with name as Saturdays and with type as DATE and sentiment with 0.0\n",
      "create new node with name as the same day and with type as DATE and sentiment with 0.0\n",
      "create new node with name as the next working day and with type as DATE and sentiment with 0.0\n",
      "create new node with name as at least three and with type as CARDINAL and sentiment with 0.0\n",
      "create new relationship NEFT - part_of -> half-hourly with confidence of 0.9198445677757263\n",
      "half-hourly NEFT part_of\n",
      "create new relationship half-hourly - part_of -> NEFT with confidence of 0.9325506091117859\n",
      "between_8_am_to_4.30_pm NEFT part_of\n",
      "create new relationship between 8 am to 4.30 pm - part_of -> NEFT with confidence of 0.8967857956886292\n",
      "create new relationship NEFT - part_of -> all working days with confidence of 0.9739091992378235\n",
      "all_working_days NEFT part_of\n",
      "create new relationship all working days - part_of -> NEFT with confidence of 0.962792158126831\n",
      "create new relationship half-hourly - part_of -> between 8 am to 4.30 pm with confidence of 0.8070828318595886\n",
      "all_working_days half-hourly has_part\n",
      "create new relationship all working days - has_part -> half-hourly with confidence of 0.8928235173225403\n",
      "the_same_day half-hourly has_part\n",
      "create new relationship the same day - has_part -> half-hourly with confidence of 0.8081007599830627\n",
      "create new relationship between 8 am to 4.30 pm - part_of -> all working days with confidence of 0.989860475063324\n",
      "all_working_days between 8 am to 4.30 pm part_of\n",
      "create new relationship all working days - part_of -> between 8 am to 4.30 pm with confidence of 0.9686828255653381\n",
      "the_next_working_day between 8 am to 4.30 pm location\n",
      "create new relationship the next working day - location -> between 8 am to 4.30 pm with confidence of 0.8118376731872559\n",
      "at_least_three between 8 am to 4.30 pm location\n",
      "create new relationship at least three - location -> between 8 am to 4.30 pm with confidence of 0.8118376731872559\n",
      "create new relationship all working days - has_part -> the same day with confidence of 0.8162183165550232\n",
      "the_same_day all working days has_part\n",
      "create new relationship the same day - has_part -> all working days with confidence of 0.9010825157165527\n",
      "create new relationship all working days - part_of -> the next working day with confidence of 0.908353865146637\n",
      "the_next_working_day all working days part_of\n",
      "create new relationship the next working day - part_of -> all working days with confidence of 0.9650444388389587\n",
      "create new relationship all working days - part_of -> at least three with confidence of 0.908353865146637\n",
      "at_least_three all working days part_of\n",
      "create new relationship at least three - part_of -> all working days with confidence of 0.9650444388389587\n",
      "create new relationship Saturdays - followed_by -> the same day with confidence of 0.8913074731826782\n",
      "the_same_day Saturdays followed_by\n",
      "create new relationship the same day - followed_by -> Saturdays with confidence of 0.9068785905838013\n",
      "create new relationship Saturdays - followed_by -> the next working day with confidence of 0.8012282252311707\n",
      "create new relationship Saturdays - followed_by -> at least three with confidence of 0.8012282252311707\n",
      "create new node with name as Rs 5 lakh and with type as MONEY and sentiment with 0.0\n",
      "create new node with name as max and with type as PERSON and sentiment with 0.0\n",
      "create new node with name as Cashline and with type as ORG and sentiment with 0.0\n",
      "create new node with name as MoneyLine and with type as ORG and sentiment with 0.0\n",
      "create new relationship Cashline - followed_by -> MoneyLine with confidence of 0.9864253997802734\n",
      "MoneyLine Cashline followed_by\n",
      "create new relationship MoneyLine - followed_by -> Cashline with confidence of 0.969420850276947\n",
      "create new node with name as below 95% and with type as PERCENT and sentiment with 0.0\n",
      "create new node with name as 2.1 and with type as CARDINAL and sentiment with 0.0\n",
      "create new node with name as 5.1 and with type as CARDINAL and sentiment with 0.0\n",
      "create new node with name as 3.5 and with type as CARDINAL and sentiment with 0.0\n",
      "create new node with name as the Principal Cardholder and with type as ORG and sentiment with 0.0\n",
      "create new node with name as the Facilities or Electronic Service and with type as ORG and sentiment with 0.0\n",
      "create new relationship Bank - has_part -> 5.1 with confidence of 0.9518246650695801\n",
      "5.1 Bank has_part\n",
      "create new relationship 5.1 - has_part -> Bank with confidence of 0.8962143063545227\n",
      "create new relationship Bank - has_part -> the Principal Cardholder with confidence of 0.818270742893219\n",
      "the_Principal_Cardholder Bank has_part\n",
      "create new relationship the Principal Cardholder - has_part -> Bank with confidence of 0.8163472414016724\n",
      "create new relationship Bank - has_part -> Cashline with confidence of 0.9626626968383789\n",
      "Cashline Bank has_part\n",
      "create new relationship Cashline - has_part -> Bank with confidence of 0.8856924176216125\n",
      "create new relationship Bank - has_part -> the Facilities or Electronic Service with confidence of 0.818270742893219\n",
      "the_Facilities_or_Electronic_Service Bank has_part\n",
      "create new relationship the Facilities or Electronic Service - has_part -> Bank with confidence of 0.8163472414016724\n",
      "create new relationship 2.1 - followed_by -> 5.1 with confidence of 0.9667105674743652\n",
      "5.1 2.1 followed_by\n",
      "create new relationship 5.1 - followed_by -> 2.1 with confidence of 0.8887096047401428\n",
      "create new relationship 2.1 - followed_by -> 3.5 with confidence of 0.9841644167900085\n",
      "3.5 2.1 followed_by\n",
      "create new relationship 3.5 - followed_by -> 2.1 with confidence of 0.9515349864959717\n",
      "create new relationship 2.1 - has_part -> Cashline with confidence of 0.8868291974067688\n",
      "Cashline 2.1 has_part\n",
      "create new relationship Cashline - has_part -> 2.1 with confidence of 0.9511043429374695\n",
      "create new relationship 5.1 - followed_by -> 3.5 with confidence of 0.9917057752609253\n",
      "3.5 5.1 followed_by\n",
      "create new relationship 3.5 - followed_by -> 5.1 with confidence of 0.988493025302887\n",
      "create new relationship 5.1 - has_part -> Cashline with confidence of 0.9588193893432617\n",
      "Cashline 5.1 has_part\n",
      "create new relationship Cashline - has_part -> 5.1 with confidence of 0.9711307287216187\n",
      "create new relationship 3.5 - followed_by -> the Principal Cardholder with confidence of 0.9685170650482178\n",
      "the_Principal_Cardholder 3.5 followed_by\n",
      "create new relationship the Principal Cardholder - followed_by -> 3.5 with confidence of 0.9748960137367249\n",
      "create new relationship 3.5 - followed_by -> the Facilities or Electronic Service with confidence of 0.9685170650482178\n",
      "the_Facilities_or_Electronic_Service 3.5 followed_by\n",
      "create new relationship the Facilities or Electronic Service - followed_by -> 3.5 with confidence of 0.9748960137367249\n",
      "create new relationship the Principal Cardholder - has_part -> Cashline with confidence of 0.969200074672699\n",
      "Cashline the Principal Cardholder has_part\n",
      "create new relationship Cashline - has_part -> the Principal Cardholder with confidence of 0.9610396027565002\n",
      "create new relationship Cashline - has_part -> the Facilities or Electronic Service with confidence of 0.9610396027565002\n",
      "the_Facilities_or_Electronic_Service Cashline has_part\n",
      "create new relationship the Facilities or Electronic Service - has_part -> Cashline with confidence of 0.969200074672699\n",
      "create new node with name as Instalment Plans/Balance Transfers and with type as ORG and sentiment with 0.0\n",
      "create new node with name as DBS Debit Card and with type as ORG and sentiment with 0.0\n",
      "create new node with name as ₹150+ and with type as MONEY and sentiment with 0.0\n",
      "create new node with name as 18% and with type as PERCENT and sentiment with 0.0\n",
      "create new node with name as the second year and with type as DATE and sentiment with 0.0\n",
      "create new node with name as ₹150+₹27 and with type as MONEY and sentiment with 0.0\n",
      "create new node with name as first and with type as ORDINAL and sentiment with 0.0\n",
      "create new node with name as July 2020 and with type as DATE and sentiment with 0.0\n",
      "create new node with name as the month of June 2020 and with type as DATE and sentiment with 0.0\n",
      "create new relationship annual - follows -> July 2020 with confidence of 0.8232366442680359\n",
      "create new relationship ₹150+ - followed_by -> ₹150+₹27 with confidence of 0.9074824452400208\n",
      "₹150+₹27 ₹150+ followed_by\n",
      "create new relationship ₹150+₹27 - followed_by -> ₹150+ with confidence of 0.9133139848709106\n",
      "create new relationship ₹150+ - followed_by -> first with confidence of 0.959620475769043\n",
      "first ₹150+ followed_by\n",
      "create new relationship first - followed_by -> ₹150+ with confidence of 0.9459831714630127\n",
      "create new relationship 18% - follows -> July 2020 with confidence of 0.8401802778244019\n",
      "July_2020 18% follows\n",
      "create new relationship July 2020 - follows -> 18% with confidence of 0.8561906218528748\n",
      "create new relationship the second year - followed_by -> first with confidence of 0.9176457524299622\n",
      "create new relationship the second year - has_part -> the month of June 2020 with confidence of 0.8748599886894226\n",
      "the_month_of_June_2020 the second year has_part\n",
      "create new relationship the month of June 2020 - has_part -> the second year with confidence of 0.8823169469833374\n",
      "create new relationship ₹150+₹27 - followed_by -> first with confidence of 0.8879770040512085\n",
      "first ₹150+₹27 followed_by\n",
      "create new relationship first - followed_by -> ₹150+₹27 with confidence of 0.8282853364944458\n",
      "create new relationship ₹150+₹27 - follows -> July 2020 with confidence of 0.886552095413208\n",
      "July_2020 ₹150+₹27 follows\n",
      "create new relationship July 2020 - follows -> ₹150+₹27 with confidence of 0.8943490982055664\n",
      "create new relationship first - followed_by -> the month of June 2020 with confidence of 0.9563534259796143\n",
      "the_month_of_June_2020 first followed_by\n",
      "create new relationship the month of June 2020 - followed_by -> first with confidence of 0.946929395198822\n",
      "create new relationship July 2020 - follows -> the month of June 2020 with confidence of 0.8750483393669128\n",
      "the_month_of_June_2020 July 2020 follows\n",
      "create new relationship the month of June 2020 - follows -> July 2020 with confidence of 0.8218408226966858\n",
      "create new node with name as 27 and with type as MONEY and sentiment with 0.0\n",
      "create new node with name as 177 and with type as MONEY and sentiment with 0.0\n",
      "create new node with name as 150+GST and with type as MONEY and sentiment with 0.0\n",
      "create new node with name as this year and with type as DATE and sentiment with 0.0\n",
      "create new relationship 150+GST - follows -> this year with confidence of 0.8746638298034668\n",
      "this_year 150+GST follows\n",
      "create new relationship this year - follows -> 150+GST with confidence of 0.8935506343841553\n",
      "create new relationship annual - followed_by -> this year with confidence of 0.9282796382904053\n",
      "this_year annual followed_by\n",
      "create new relationship this year - followed_by -> annual with confidence of 0.9409143328666687\n",
      "create new relationship 150+GST - follows -> this year with confidence of 0.8491032719612122\n",
      "this_year 150+GST follows\n",
      "create new relationship this year - follows -> 150+GST with confidence of 0.8701411485671997\n",
      "create new relationship the second year - followed_by -> this year with confidence of 0.9191649556159973\n",
      "this_year the second year followed_by\n",
      "create new relationship this year - followed_by -> the second year with confidence of 0.8249390721321106\n",
      "create new node with name as 4 and with type as CARDINAL and sentiment with 0.0\n",
      "create new node with name as that year and with type as DATE and sentiment with 0.0\n",
      "create new relationship annual - follows -> 4 with confidence of 0.8168418407440186\n",
      "create new relationship 4 - follows -> that year with confidence of 0.9045310020446777\n",
      "that_year 4 follows\n",
      "create new relationship that year - follows -> 4 with confidence of 0.8773844838142395\n",
      "create new relationship 4 - follows -> that year with confidence of 0.8892529010772705\n",
      "that_year 4 follows\n",
      "create new relationship that year - follows -> 4 with confidence of 0.8769173622131348\n",
      "create new node with name as Debit Card and with type as ORG and sentiment with 0.0\n",
      "create new node with name as 2 million ATMs and with type as QUANTITY and sentiment with 0.0\n",
      "create new relationship Debit Card - part_of -> 2 million ATMs with confidence of 0.9898183941841125\n",
      "2_million_ATMs Debit Card part_of\n",
      "create new relationship 2 million ATMs - part_of -> Debit Card with confidence of 0.9888796806335449\n",
      "create new relationship 2 million ATMs - part_of -> 177 with confidence of 0.8643143177032471\n",
      "177 2 million ATMs part_of\n",
      "create new relationship 177 - part_of -> 2 million ATMs with confidence of 0.9323571920394897\n",
      "create new node with name as India and with type as GPE and sentiment with 0.0\n",
      "create new node with name as nearly 2,00,000 ATMs and with type as QUANTITY and sentiment with 0.0\n",
      "create new node with name as Visa Tap to Pay and with type as ORG and sentiment with 0.0\n",
      "create new node with name as Point and with type as ORG and sentiment with 0.0\n",
      "create new node with name as up to INR 2,000 and with type as MONEY and sentiment with 0.0\n",
      "create new node with name as PoS and with type as ORG and sentiment with 0.0\n",
      "PoS Point has_part\n",
      "create new relationship PoS - has_part -> Point with confidence of 0.8197041749954224\n",
      "create new relationship up to INR 2,000 - has_part -> PoS with confidence of 0.9767981767654419\n",
      "PoS up to INR 2,000 has_part\n",
      "create new relationship PoS - has_part -> up to INR 2,000 with confidence of 0.989628791809082\n"
     ]
    }
   ],
   "source": [
    "knowledgeExtraction(questions,answers,FAQIDs)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 186,
   "id": "0261a4d2-d064-4bf7-91be-831fdf231867",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Question: What is DBS Online Rewards?\n",
      "Answer: DBS Online rewards website allows you to check your DBS points and redeem rewards online.\n",
      "Question: How do I login to redeem?\n",
      "Answer: Simply enter your digibank user ID and PIN to login.\n",
      "\n",
      "For Daily$ rebates, please login to <a href=\"https://internet-banking.dbs.com.sg/\">DBS iBanking</a>  to redeem your Daily$ rebates\n",
      "Question: I am not an existing DBS iBanking customer; can I still redeem my points online?\n",
      "Answer: No. You will need to register for a digibank user ID to perform DBS rewards redemption. Click <a href=\"https://internet-banking.dbs.com.sg/ibAPL/Welcome\" >here</a>  to register now.\n",
      "\n",
      "Question: I am not a DBS Cardmember, can I still access the DBS Online Rewards website?\n",
      "Answer: Yes. You can still browse the website to gather information. However, you need to be a DBS credit cardmember and digibank user to login. To sign up for a DBS credit card, please visit <a href=\"https://www.dbs.com.sg/personal/cards/default.page\" >www.dbs.com/sg/cards</a>.\n",
      "Question: I have more than one DBS Credit Card. How can I redeem my DBS Points on this rewards site?\n",
      "Answer: You can login with your digibank user ID and PIN. All DBS points accumulated via all your eligible credit cards will be automatically consolidated to your account.\n",
      "Question: Can I change the billing address displayed in my account?\n",
      "Answer: No. For security reasons, change of billing address is not permitted via this site. You may update your address via DBS/POSB iBanking or DBS/POSB digibank app. Refer to update profile steps <a href=\"https://www.dbs.com.sg/personal/support/general-product.html\" >here</a>.\n",
      "Question: Are all my DBS Credit Cards eligible for redemption on this website?\n",
      "Answer: All DBS reward point-earning credit cards are eligible for the redemption programme. DBS Corporate Liability Card, DBS Purchasing Card, Country Club Corporate Card, DBS Live Fresh Card, DBS Saab Credit Card, DBS Takashimaya Card, DBS Esso Card, DBS yuu Card, SAFRA DBS Credit/Debit Card, POSB Credit Card and all DBS and POSB Debit Cards are not eligible for this DBS points reward redemption program.\n",
      "Question: How can I view my DBS Points and expiry date?\n",
      "Answer: After login, please click on \"My DBS Points Details\" and all your DBS Points will be displayed with the respective expiry dates.\n",
      "Question: How do I search for rewards?\n",
      "Answer: Please use the search bar below the menu. You can search for products by the following ways:\n",
      "\n",
      "Points range - drag the number\n",
      "Enter a keyword into the text box\n",
      "Select any one of the category on the menu bar\n",
      "Question: How do I redeem for items?\n",
      "Answer: Drag and drop the item into the shopping cart on the right, you may increase or decrease quantity by clicking on the + or - sign.\n",
      "Click on the product and a light box will open up, enter desired quantity and click \"Add to cart\"\n",
      "Question: How do I delete an item from the shopping cart?\n",
      "Answer: Click on the - (minus) sign until it is removed from the shopping cart\n",
      "Go to \"View shopping cart\" and click on \"Remove\" to delete item\n",
      "Question: If I spend on my credit card now, how long does it take for me to be able to redeem on the points?\n",
      "Answer: Your credit card points will be updated once the merchant has posted the transaction(s) and it will be reflected in your account within 24 hours.\n",
      "\n",
      "Please note that DBS shall have the discretion to postpone the awarding of credit card points for a reasonable period in the event of unforeseen circumstances, including any delay arising from system issues.\n",
      "\n"
     ]
    }
   ],
   "source": [
    "query = (\n",
    "        \"MATCH (f)-[:HAS_SUBSECTION]->(SubSection {name:'DBS Online Rewards'}) RETURN f.Question AS Question, f.Answer AS Answer \"\n",
    ")\n",
    "\n",
    "# Execuate above query to modify neo4j db:\n",
    "with graph.session() as session:\n",
    "    results = session.run(query)\n",
    "    for result in results:\n",
    "        print('Question' + ': '+result['Question'])\n",
    "        print('Answer' + ': '+result['Answer'])"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 187,
   "id": "bd35efe6-c658-4a22-b1e2-3b2536222249",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Question: What is DBS Online Rewards?\n",
      "Answer: DBS Online rewards website allows you to check your DBS points and redeem rewards online.\n"
     ]
    }
   ],
   "source": [
    "query = (\n",
    "        \"MATCH (f {Question:'What is DBS Online Rewards?'}) RETURN f.Question AS Question, f.Answer AS Answer \"\n",
    ")\n",
    "\n",
    "# Execuate above query to modify neo4j db:\n",
    "with graph.session() as session:\n",
    "    results = session.run(query)\n",
    "    for result in results:\n",
    "        print('Question' + ': '+result['Question'])\n",
    "        print('Answer' + ': '+result['Answer'])"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 188,
   "id": "050bdcc2-1cbf-45dd-8789-d2b3224dd7ce",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "SubSection: Applying for a DBS Debit Card or Credit Card\n",
      "SubSection: DBS Reward Points / DBS Online Rewards\n",
      "SubSection: DBS Online Rewards\n",
      "SubSection: Paying Your Credit Card Balance\n",
      "SubSection: Charge Disputes\n",
      "SubSection: Cancelling and Replacing Cards, Changing Your PIN\n",
      "SubSection: Upgrading or Changing Cards\n",
      "SubSection: Cash Advance and Funds Transfer\n",
      "SubSection: Enhancing Card Usage Security\n",
      "SubSection: Card Activation\n",
      "SubSection: Credit Card\n",
      "SubSection: Credit Card \n",
      "SubSection: Cancel Card\n",
      "SubSection: Card Upgrade\n",
      "SubSection: Overlimit Suspension\n"
     ]
    }
   ],
   "source": [
    "query = (\n",
    "        \"MATCH (ss)-[:SUBSECTION_OF]->(Section {name:'Bank Cards'}) RETURN ss.name AS SubSection\"\n",
    ")\n",
    "\n",
    "# Execuate above query to modify neo4j db:\n",
    "with graph.session() as session:\n",
    "    results = session.run(query)\n",
    "    for result in results:\n",
    "        print('SubSection' + ': '+result['SubSection'])"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 275,
   "id": "abd7cb69-142a-491c-a17e-a059903c3a90",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Name: DBS Credit/Debit Card\n",
      "Name: DBS Credit/Debit Card\n",
      "Name: DBS Credit/Debit Card\n"
     ]
    }
   ],
   "source": [
    "query = (\n",
    "        #\"MATCH (ORG)-[:instance_of]->(ORG {name: 'DBS Credit/Debit Card'}) RETURN ORG.name AS name\"\n",
    "        \"MATCH p=()-[:instance_of]->(ORG {name: 'DBS Credit/Debit Card'}) RETURN ORG.name AS name\"\n",
    ")\n",
    "\n",
    "# Execuate above query to modify neo4j db:\n",
    "with graph.session() as session:\n",
    "    results = session.run(query)\n",
    "    for result in results:\n",
    "        print('Name' + ': '+result['name'])"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 282,
   "id": "bc2c28bc-b611-4994-b34d-4bcb81ba3f2b",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "<neo4j._sync.work.result.Result object at 0x19d405c10>\n",
      "<Path start=<Node element_id='4:5e2359e9-89fa-457b-b603-d6efe892f544:42' labels=frozenset({'Question'}) properties={'Label': 'Am I eligible for a debit card?'}> end=<Node element_id='4:5e2359e9-89fa-457b-b603-d6efe892f544:41' labels=frozenset({'FAQ'}) properties={'Answer': 'You must be at least 16 years old and have a POSB Savings Account, DBS Savings Plus Account, DBS Autosave Account or DBS Current Account. To open one of these accounts, click <a href=\"https://www.dbs.com.sg/personal/deposits/bank-with-ease/addon-casa\" >here</a>\\n\\nIf you are a foreigner, please apply for a debit card at any of our branches. You will need to present your passport and an employment pass that is valid for at least 6 months.', 'Label': 'eligible_debit_card', 'Question': 'Am I eligible for a debit card?', 'Id': 1}> size=1>\n",
      "<Path start=<Node element_id='4:5e2359e9-89fa-457b-b603-d6efe892f544:399' labels=frozenset({'Answer'}) properties={'Label': 'You must be at least 16 years old and have a POSB Savings Account, DBS Savings Plus Account, DBS Autosave Account or DBS Current Account. To open one of these accounts, click <a href=\"https://www.dbs.com.sg/personal/deposits/bank-with-ease/addon-casa\" >here</a>\\n\\nIf you are a foreigner, please apply for a debit card at any of our branches. You will need to present your passport and an employment pass that is valid for at least 6 months.'}> end=<Node element_id='4:5e2359e9-89fa-457b-b603-d6efe892f544:41' labels=frozenset({'FAQ'}) properties={'Answer': 'You must be at least 16 years old and have a POSB Savings Account, DBS Savings Plus Account, DBS Autosave Account or DBS Current Account. To open one of these accounts, click <a href=\"https://www.dbs.com.sg/personal/deposits/bank-with-ease/addon-casa\" >here</a>\\n\\nIf you are a foreigner, please apply for a debit card at any of our branches. You will need to present your passport and an employment pass that is valid for at least 6 months.', 'Label': 'eligible_debit_card', 'Question': 'Am I eligible for a debit card?', 'Id': 1}> size=1>\n"
     ]
    }
   ],
   "source": [
    "query = (\n",
    "    \"MATCH p=()-[:PART_OF]->(FAQ {Id : 1}) RETURN p LIMIT 25;\"\n",
    ")\n",
    "\n",
    "# Execuate above query to modify neo4j db:\n",
    "with graph.session() as session:\n",
    "    results = session.run(query)\n",
    "    print(results)\n",
    "    for result in results:\n",
    "        print(result['p'])"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "6efeb365-56cc-4d0c-b79f-948224946587",
   "metadata": {},
   "outputs": [],
   "source": [
    "results"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 21,
   "id": "758c4996-d8f3-4d86-9958-7166a430725d",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Label: eligible_credit_card\n",
      "Question: Am I eligible for a credit card?\n",
      "Answer: If you're Singaporean or have permanent residency and you're over 21 years of age, you can apply for a DBS <a href=\"https://www.dbs.com.sg/personal/cards/credit-cards/default.page\"> Credit Card </a>. You'll need to earn at least S$30,000 a year. For some cards, especially Platinum cards, you'll need to earn more so check the Application Details for the card you're interested in.\n",
      "\n",
      "If you're a foreigner with a valid employment pass, you'll need to earn a least S$45,000 a year unless otherwise stated.\n",
      "\n"
     ]
    }
   ],
   "source": [
    "query = (\n",
    "    \"\"\"MATCH p=(e:Entity)-[:MENTIONS]->(f:FAQ) \n",
    "    WHERE (toLower(e.name)='platinum') \n",
    "    RETURN f.Label AS Label, f.Question AS Question, f.Answer AS Answer LIMIT 25;\"\"\"\n",
    ")\n",
    "# Execuate above query to modify neo4j db:\n",
    "with graph.session() as session:\n",
    "    results = session.run(query)\n",
    "    for result in results:\n",
    "        print(\"Label: \" + result['Label'])\n",
    "        print(\"Question: \" + result['Question'])\n",
    "        print(\"Answer: \" + result['Answer'])"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "4fb8293a-fb23-4a97-91cf-37cb6259d8c7",
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3 (ipykernel)",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.11.7"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
